Repository: MCCTeam/Minecraft-Console-Client
Catalog: MinecraftClient/Resources/Translations/Translations.*.resx
Languages: ru, tr, zh_hans, zh_hant

# bot.DiscordBridge.direction
source: Direction of the Discord Brdige has been switched to '{0}'!
ru: Направление Discord Brdige было переключено на '{0}'!
tr: Discord Bridge yönü '{0}' olarak değiştirildi!
zh_hans: Discord Brdige信息转发方向已更改为 {0} ！

# bot.DiscordBridge.direction.both
source: Both
ru: Оба
tr: İkisi de
zh_hans: 全部

# bot.DiscordBridge.guild_not_found
source: The provided guild/server with an id '{0}' has not been found!
ru: Гильдия/сервер с идентификатором '{0}' не найден!
tr: '{0}' kimliğine sahip sağlanan guild/server bulunamadı!
zh_hans: 找不到ID为 '{0}' 的服务器！

# bot.DiscordBridge.invalid_direction
source: Invalid direction provided! Available directions: both|b, minecraft|mc, discord|dsc. Example: "dscbridge direction mc"
ru: Недопустимое направление! Доступные направления: как для |b, minecraft|mc, discord|dsc. Пример: "dscbridge direction mc"
tr: Geçersiz yön sağlandı! Mevcut yol tarifleri: both|b, minecraft|mc, discord|dsc. Örnek: "dscbridge direction mc"
zh_hans: 无效的信息方向！可选：both|b，minecraft|mc，discord|dsc。例如："dscbridge direction mc"

# bot.DiscordBridge.missing_token
source: Please provide a valid token!
ru: Пожалуйста, укажите корректный дискорд токен!
tr: Lütfen geçerli bir token sağlayın!
zh_hans: 请提供一个有效的令牌！

# bot.DiscordBridge.unknown_error
source: An unknown error has occured!
ru: Произошла неизвестная ошибка!
tr: Bilinmeyen bir hata oluştu!
zh_hans: 发生了未知错误 ！

# bot.farmer.already_running
source: The bot is already farming!
ru: Этот бот уже фармит!
tr: Farmer zaten çalışıyor
zh_hans: 机器人已经在耕种了！

# bot.farmer.already_stopped
source: The bot has already stopped farming!
ru: Бот уже прекратил фарминг!
tr: Farmer Bot zaten durdurdu!
zh_hans: 机器人已停止耕作！

# bot.farmer.crop_type
source: Crop type
ru: Тип культуры
tr: Kırpma türü
zh_hans: 农作物类型

# bot.farmer.desc
source: Farming bot
ru: Фарминг бот
tr: Çiftçilik botu
zh_hans: 耕作机器人

# bot.farmer.invalid_crop_type
source: Invalid crop type provided (Types which you can use: Beetroot, Carrot, Melon, Netherwart, Pumpkin, Potato, Wheat)!
ru: Предоставлен недопустимый тип посадки (Типы, которые вы можете использовать: Свекла, Морковь, арбуз, Адский нарост, Картофель, Пшеница)!
tr: Geçersiz kırpma türü sağlandı (Kullanabileceğiniz Türler: Beetroot, Carrot, Melon, Netherwart, Pumpkin, Potato, Wheat)!
zh_hans: 提供了无效的农作物类型（可选的类型：Beetroot（甜菜根）, Carrot（萝卜）, Melon（西瓜）, Netherwart（地狱疣）, Pumpkin（南瓜）, Potato（马铃薯）, Wheat（小麦））

# bot.farmer.invalid_radius
source: Invalid radius provided, you must provide a valid integer number greater than 0!
ru: Указан неверный радиус, вы должны указать допустимое целое число больше 0!
tr: Geçersiz yarıçap sağlandı, 0dan büyük geçerli bir tam sayı sağlamalısınız!
zh_hans: 所提供的半径无效，您必须提供一个大于0的整数！

# bot.farmer.needs_inventory
source: The Farmer bot needs Inventory Handling in order to work, please enable it!
ru: Боту фермера нужна обработка инвентаря для работы, пожалуйста, включите его!
tr: Farmer botu kullanmak için Inventory Handling özelliğini açın!
zh_hans: 自动种植机器人需要库存处理才能运作，请启用库存处理！

# bot.farmer.needs_terrain
source: The Farmer bot needs Terrain Handling in order to work, please enable it!
ru: Для работы фермерскому боту нужна обработка местности, пожалуйста, включите её!
tr: Farmer botu kullanmak için Terrain and Movements özelliğini etkinleştirin!
zh_hans: 自动种植机器人需要地形处理才能运作，请启用地形处理！

# bot.farmer.not_implemented
source: Not implemented bellow 1.13!
ru: Не реализовано ниже 1.13!
tr: 1.13ün altında çalışmaz!
zh_hans: 不支持1.13以下的版本！

# bot.farmer.radius
source: Radius
ru: Радиус
tr: Yarçap
zh_hans: 半径

# bot.farmer.started
source: Started farming!
ru: Фарминг запущен!
tr: Farmer başladı
zh_hans: 开始耕种！

# bot.farmer.stopped
source: Stopped farming!
ru: Фарминг остановлен!
tr: Farmer durdu
zh_hans: 停止耕种！

# bot.farmer.stopping
source: Stoping farming, this might take a second...
ru: Остановка фарминга, это может занять секунду...
tr: Farmer durduruluyor, bu bir saniye sürebilir...
zh_hans: 正在停止耕作，这可能需要几秒钟...

# bot.farmer.warining_allow_teleport
source: You have enabled teleporting, this might get your bot account kicked and in the worst case scenario banned! Use with caution!
ru: Вы включили телепортацию, это может привести к тому, что ваш бот кикнут, а в худшем случае сценарий запрещён! С осторожностью!
tr: Işınlamayı etkinleştirdiniz, bu bot hesabınızın açılmasına ve en kötü senaryoda yasaklanmasına neden olabilir! Dikkatle kullanın!
zh_hans: 您已启用传送，你的帐号可能因此被踢出甚至被封禁。请小心使用！

# bot.farmer.warining_force_unsafe
source: You have enabled un-safe movement, the bot might get hurt!
ru: Вы включили небезопасное движение, бот может навредить!
tr: Güvenli olmayan hareketi etkinleştirdiniz, bot zarar görebilir!
zh_hans: 您已启用不安全的移动，机器人可能会受到伤害！

# bot.farmer.warining_invalid_parameter
source: Invalid parameter "{0}" provided (Use format: "key:value")!
ru: Предоставлен недопустимый параметр "{0}" (формат использования: "key:value")!
tr: Geçersiz "{0}" parametresi sağlandı(Biçimi kullanın: "key:value")!
zh_hans: 提供了无效的参数 "{0}"（正确格式："键:值"）

# bot.mailer.cmd
source: mailer command
ru: команда почтового клиента
zh_hans: mailer 命令
zh_hant: Mailer 命令

# bot.mailer.cmd.getignored
source: --- Ignore list --- {0}
ru: --- Список игнорирования --- {0}
tr: --- Ignore listesi --- {0}
zh_hans: --- 忽略列表 --- {0}
zh_hant: --- 忽略列表 --- {0}

# bot.mailer.cmd.getmails
source: --- Mails in database --- {0}
ru: --- Почта в базе данных --- {0}
tr: --- Veritabanındaki postalar --- {0}
zh_hans: --- 数据库中的邮件 --- {0}
zh_hant: --- 資料庫中的郵件 --- {0}

# bot.mailer.cmd.help
source: See usage
ru: Смотрите использование
tr: Kullanıma bakın
zh_hans: 查看用法
zh_hant: 檢視用法

# bot.mailer.cmd.ignore.added
source: Added {0} to the ignore list!
ru: Добавил {0} в список игнорирования!
tr: {0} ignore listesine eklendi!
zh_hans: 添加{0}到忽略列表！
zh_hant: 新增{0}到忽略列表！

# bot.mailer.cmd.ignore.invalid
source: Missing or invalid name. Usage: {0} <username>
ru: Пропущено или недопустимое имя. Использование: {0} <имя пользователя
tr: Eksik veya geçersiz ad. Kullanım: {0} <username>
zh_hans: 丢失或无效的名称。用法：{0}<用户名>
zh_hant: 丟失或無效的名稱。用法：{0}<使用者名稱>

# bot.mailer.cmd.ignore.removed
source: Removed {0} from the ignore list!
ru: Удалил {0} из списка игнорирования!
tr: {0} ignore listesinden çıkarıldı!
zh_hans: {0}已从忽略列表中删除！
zh_hant: {0}已從忽略列表中刪除！

# bot.mailer.create.db
source: Creating new database file: {0}
ru: Создание нового файла базы данных: {0}
tr: Yeni veritabanı dosyası oluşturma: {0}
zh_hans: 创建新数据库文件：{0}
zh_hant: 建立新資料庫檔案：{0}

# bot.mailer.create.ignore
source: Creating new ignore list: {0}
ru: Создание нового списка игнорирования: {0}
tr: Yeni yok sayma listesi oluşturuluyor: {0}
zh_hans: 创建新忽略列表：{0}
zh_hant: 建立新忽略列表：{0}

# bot.mailer.delivered
source: Delivered: {0}
ru: Доставлено: {0}
tr: Teslim edildi: {0}
zh_hans: 已发送：{0}
zh_hant: 已傳送：{0}

# bot.mailer.init
source: Initializing Mailer with settings:
ru: Инициализация Mailer с настройками:
tr: Mailerı ayarlarla başlatma:
zh_hans: 使用设置初始化Mailer：
zh_hant: 使用設定初始化Mailer：

# bot.mailer.init.db
source: - Database File: {0}
ru: - Файл базы данных: {0}
tr: - Veritabanı dosyası: {0}
zh_hans: - 数据库文件：{0}
zh_hant: - 資料庫檔案：{0}

# bot.mailer.init.db_size
source: - Max Database Size: {0}
ru: - Максимальный размер базы данных: {0}
tr: - Maksimum Veritabanı Boyutu: {0}
zh_hans: - 最大数据库大小：{0}
zh_hant: - 最大資料庫大小：{0}

# bot.mailer.init.ignore
source: - Ignore List: {0}
ru: - Список игнорирования: {0}
tr: - Ignore listesi: {0}
zh_hans: - 忽略列表：{0}
zh_hant: - 忽略列表：{0}

# bot.mailer.init.mail_retention
source: - Mail Retention: {0}
ru: - Хранение почты: {0}
tr: - Posta Tutma: {0}
zh_hans: - 邮件保留天数：{0}
zh_hant: - 郵件保留天數：{0}

# bot.mailer.init.max_mails
source: - Max Mails per Player: {0}
ru: - Максимальное количество писем на игрока: {0}
tr: - Oyuncu Başına Maksimum Posta: {0}
zh_hans: - 每位玩家最多邮件数：{0}
zh_hant: - 每位玩家最多郵件數：{0}

# bot.mailer.init.public
source: - Public Interactions: {0}
ru: - Публичные взаимодействия: {0}
tr: - Public etkileşimleri: {0}
zh_hans: - 公开交互：{0}
zh_hant: - 公開互動：{0}

# bot.mailer.init_fail.db_size
source: Cannot enable Mailer: Max Database Size must be greater than zero. Please review the settings.
ru: Невозможно включить почтовый сервер: Максимальный размер базы данных должен быть больше нуля. Пожалуйста, проверьте настройки.
tr: Mailer etkinleştirilemiyor: Maksimum Veritabanı Boyutu sıfırdan büyük olmalıdır. Lütfen ayarları gözden geçirin.
zh_hans: 无法启用Mailer：最大数据库大小必须大于0。请检查设置。
zh_hant: 無法啟用Mailer：最大資料庫大小必須大於0。請檢查設定。

# bot.mailer.init_fail.mail_retention
source: Cannot enable Mailer: Mail Retention must be greater than zero. Please review the settings.
ru: Невозможно включить Mailer: Mail Retention должно быть больше нуля. Пожалуйста, ознакомьтесь с настройками.
tr: Mailer etkinleştirilemiyor: Posta Tutma sıfırdan büyük olmalıdır. Lütfen ayarları gözden geçirin.
zh_hans: 无法启用Mailer：邮件保留天数必须大于0。请检查设置。
zh_hant: 無法啟用Mailer：郵件保留天數必須大於0。請檢查設定。

# bot.mailer.init_fail.max_mails
source: Cannot enable Mailer: Max Mails per Player must be greater than zero. Please review the settings.
ru: Невозможно включить Mailer: Max Mails per Player должно быть больше нуля. Пожалуйста, просмотрите настройки.
tr: Mailer etkinleştirilemiyor: Oyuncu Başına Maksimum Posta Sayısı sıfırdan büyük olmalıdır. Lütfen ayarları gözden geçirin.
zh_hans: 无法启用Mailer：每个玩家的最大邮件数必须大于0。请检查设置。
zh_hant: 無法啟用Mailer：每個玩家的最大郵件數必須大於0。請檢查設定。

# bot.mailer.load.db
source: Loading database file: {0}
ru: Загрузка файла базы данных: {0}
tr: Veritabanı dosyası yükleniyor: {0}
zh_hans: 加载数据库文件：{0}
zh_hant: 載入資料庫檔案：{0}

# bot.mailer.load.ignore
source: Loading ignore list:
ru: Загрузка списка игнорирования:
tr: İgnore listesi yükleniyor:
zh_hans: 加载忽略列表：
zh_hant: 載入忽略列表：

# bot.mailer.process_mails
source: Looking for mails to send @ {0}
ru: Ищет письма для отправки @ {0}
tr: @ {0} gönderilecek postalar aranıyor
zh_hans: 正在查找要发送的邮件 @ {0}
zh_hant: 正在查詢要傳送的郵件 @ {0}

# bot.mailer.saving
source: Saving message: {0}
ru: Сохранение сообщения: {0}
tr: Mesaj kaydediliyor: {0}
zh_hans: 正在保存邮件：{0}
zh_hant: 正在儲存郵件：{0}

# bot.mailer.user_ignored
source: {0} is ignored!
ru: {0} игнорируется!
tr: {0} artık önemsenmiyor!
zh_hans: {0}已被忽略!
zh_hant: {0}已被忽略!

# bot.map.cmd.desc
source: Render maps (item maps)
ru: Отобразить карты (предметы карт)
tr: Haritaları oluştur (öğe haritaları)
zh_hans: 渲染物品形式的地图
zh_hant: 渲染物品形式的地圖

# bot.map.cmd.invalid_id
source: Invalid ID provided, must be a number!
ru: Указан неверный ID, должен быть число!
tr: Sağlanan geçersiz kimlik, bir sayı olmalıdır!
zh_hans: 无效的地图编号，必须是一个数字。
zh_hant: 無效的地圖編號，必須是一個數字。

# bot.map.cmd.not_found
source: A map with id '{0}' does not exists!
ru: Карта с id '{0}' не существует!
tr: '{0}' kimliğine sahip bir harita mevcut değil!
zh_hans: 没有找到编号为 '{0}' 的地图！
zh_hant: 沒有找到編號為 '{0}' 的地圖！

# bot.map.failed_to_render
source: Failed to render the map with id: '{0}'
ru: Не удалось отобразить карту с идентификатором: '{0}'
tr: Harita şu kimlikle oluşturulamadı: '{0}'
zh_hans: 无法渲染编号为 '{0}' 的地图。
zh_hant: 無法渲染編號為 '{0}' 的地圖。

# bot.map.list_item
source: - Map id: {0} (Last Updated: {1})
ru: - Id карты: {0} (Последнее обновление: {1})
tr: - Harita kimliği: {0} (Son Güncelleme: {1})
zh_hans: - 地图编号：{0}（最近更新于：{1}）
zh_hant: - 地圖編號：{0}（最近更新於：{1}）

# bot.map.no_maps
source: No maps received!
ru: Карты не получены!
tr: Harita alınmadı!
zh_hans: 没有收到过地图！
zh_hant: 沒有收到過地圖！

# bot.map.received
source: The list of received maps from the server:
ru: Список полученных карт с сервера:
tr: Sunucudan alınan haritaların listesi:
zh_hans: 从服务器接收到的地图有：
zh_hant: 從伺服器接收到的地圖有：

# bot.map.received_map
source: Received a new Map, with Id: {0}
ru: Получена новая карта, с Id: {0}
tr: Şu kimlikli yeni bir Harita alındı: {0}
zh_hans: 收到一个编号为 {0} 的新地图。
zh_hant: 收到一個編號為 {0} 的新地圖。

# bot.map.rendered
source: Succesfully rendered a map with id '{0}' to: '{1}'
ru: Карта с идентификатором '{0}' ' успешно отобрана: '{1}'
tr: '{0}' kimliğine sahip bir harita başarıyla oluşturuldu: '{1}'
zh_hans: 成功接收到地图 '{0}' ，保存为 '{1}'
zh_hant: 成功接收到地圖 '{0}' ，儲存為 '{1}'

# bot.map.resized_rendered_image
source: Resized the rendered image of the map with id: '{0}' to {1}x{1}.
ru: Изменено отображенное изображение карты с идентификатором: '{0}' до {1}x{1}.
tr: '{0}' kimliğine sahip haritanın oluşturulan görüntüsünü {1}x{1} olarak yeniden boyutlandırdı.
zh_hans: 已调整地图ID '{0}' 的大小为 {1}x{1}。

# bot.map.scale
source: The size of the map is reduced from ({0}x{1}) to ({2}x{3}) due to the size limitation of the current terminal.
ru: Размер карты снижается с ({0}x{1}) до ({2}x{3}) из-за ограничения размера текущего терминала.
tr: Mevcut terminalin boyut sınırlaması nedeniyle haritanın boyutu ({0}x{1})den ({2}x{3})e düşürüldü.
zh_hans: 由于当前终端尺寸限制，地图大小由 ({0}x{1}) 缩小为 ({2}x{3}) 。
zh_hant: 由於當前終端尺寸限制，地圖大小由 ({0}x{1}) 縮小為 ({2}x{3}) 。

# bot.map.sent_to_discord
source: Sent a rendered image of a map with an id '{0}' to the Discord via Discord Brdige chat bot!
ru: Отправлено изображение карты с идентификатором '{0}' ' ' в Discord через чат-бот дискорд бота!
tr: Discord Brdige sohbet botu aracılığıyla Discorda '{0}' kimlikli bir haritanın işlenmiş bir görüntüsünü gönderdi!
zh_hans: 已通过Discord Brdige发送ID为 '{0}' 的地图至Discord。

# bot.map.sent_to_telegram
source: Sent a rendered image of a map with an id '{0}' to the Telegram via Telegram Bridge chat bot!
ru: Отправлено изображение карты с идентификатором '{0}' в Телеграм через чат-бот Телеграм бот!
tr: Telegram Bridge sohbet botu aracılığıyla Telegrama '{0}' kimlikli bir haritanın işlenmiş bir görüntüsünü gönderdi!
zh_hans: 已通过Telegram Brdige发送ID为 '{0}' 的地图至Telegram。

# bot.replayCapture.cmd
source: replay command
ru: команда воспроизведения
zh_hans: replay 命令
zh_hant: replay 命令

# bot.replayCapture.created
source: Replay file created.
ru: Файл воспроизведения создан.
tr: Yeniden oynatma dosyası oluşturuldu.
zh_hans: 已创建重播文件。
zh_hant: 已建立重播檔案。

# bot.replayCapture.restart
source: Record was stopped. Restart the program to start another record.
ru: Запись была остановлена. Перезапустите программу, чтобы начать другую запись.
tr: Kayıt durduruldu. Başka bir kayıt başlatmak için programı yeniden başlatın.
zh_hans: 录制已停止。请重新启动程序以进行另一段录制。
zh_hant: 錄製已停止。請重新啟動程式以進行另一段錄製。

# bot.replayCapture.stopped
source: Record stopped.
ru: Запись остановлена.
tr: Kayıt durduruldu.
zh_hans: 录制已停止。
zh_hant: 錄製已停止。

# bot.script.fail
source: Script '{0}' failed to run ({1}).
ru: Сценарий '{0}' не удалось запустить ({1}).
tr: '{0}' komut dosyası çalıştırılamadı ({1}).
zh_hans: 脚本'{0}'运行失败 ({1})。
zh_hant: 指令碼'{0}'執行失敗 ({1})。

# bot.script.file_not_found
source: File not found: '{0}'
ru: Файл не найден: '{0}'
tr: Dosya bulunamadı: '{0}'
zh_hans: 找不到文件或目录： '{0}'
zh_hant: 找不到檔案：'{0}'

# bot.script.not_found
source: [MCC] [{0}] Cannot find script file: {1}
ru: §8[MCC] [{0}] Не удается найти файл скрипта: {1}
tr: §8[MCC] [{0}] Komut dosyası bulunamıyor: {1}
zh_hans: §8[MCC] [{0}] 找不到脚本文件：{1}
zh_hant: §8[MCC] [{0}] 找不到指令碼檔案：{1}

# bot.script.pm.loaded
source: Script '{0}' loaded.
ru: Сценарий '{0}' загружен.
tr: Komut dosyası '{0}' yüklendi.
zh_hans: 脚本'{0}'加载。
zh_hant: 指令碼'{0}'載入。

# bot.scriptScheduler.loaded_task
source: Loaded task: {0}
ru: Загруженная задача: {0}
tr: Yüklenen görev: {0}
zh_hans: 已加载任务： {0}
zh_hant: 已載入任務： {0}

# bot.scriptScheduler.no_action
source: No action for task: {0}
ru: Нет действия для задачи: {0}
tr: Görev için işlem yok: {0}
zh_hans: 任务没有对应操作： {0}
zh_hant: 任務沒有對應操作： {0}

# bot.scriptScheduler.no_trigger
source: This task will never trigger: {0}
ru: Эта задача никогда не сработает: {0}
tr: Bu görev asla şunları tetiklemeyecek: {0}
zh_hans: 这个任务永远不会触发： {0}
zh_hant: 這個任務永遠不會觸發： {0}

# bot.scriptScheduler.running_inverval
source: Interval / Running action: {0}
ru: Интервал / Выполняемое действие: {0}
tr: Interval / Yürütülen işlem: {0}
zh_hans: 间隔 / 运行中的操作：{0}
zh_hant: 間隔 / 執行中的操作：{0}

# bot.scriptScheduler.running_login
source: Login / Running action: {0}
ru: Login / Выполняемое действие: {0}
tr: Login / Yürütülen işlem: {0}
zh_hans: 登录 / 运行中的操作：{0}
zh_hant: 登入 / 執行中的操作：{0}

# bot.scriptScheduler.running_time
source: Time / Running action: {0}
ru: Время / Выполнение действия: {0}
tr: Time / Yürütülen işlem: {0}
zh_hans: 时间 / 运行中的操作：{0}
zh_hant: 時間 / 執行中的操作：{0}

# bot.scriptScheduler.task
source: triggeronfirstlogin: {0} triggeronlogin: {1} triggerontime: {2} triggeroninterval: {3} timevalue: {4} timeinterval: {5} action: {6}
ru: triggeronfirstlogin: {0} triggeronlogin: {1} triggerontime: {2} triggeroninterval: {3} timevalue: {4} временной интервал: {5} действие: {6}
tr: triggeronfirstlogin: {0} triggeronlogin: {1} triggerontime: {2} triggeroninterval: {3} timevalue: {4} timeinterval: {5} işlem: {6}
zh_hans: 首次登录时触发: {0} 登录时触发: {1} 指定时刻触发: {2} 指定时间间隔触发: {3} 时刻触发配置: {4} 间隔触发配置: {5} 动作: {6}

# bot.TelegramBridge.canceled_sending
source: Sending message to Telegram was canceled due an error occuring. For more info enable Debug.
ru: Отправка сообщения в Телеграм была отменена из-за ошибки. Для получения дополнительной информации включите Отладку.
tr: Oluşan bir hata nedeniyle Telegrama mesaj gönderme iptal edildi. Daha fazla bilgi için Hata Ayıklamayı etkinleştirin.
zh_hans: 发生错误，已取消发送信息至Telegram。打开调试日志以获得更多信息。

# bot.TelegramBridge.command_executed
source: The command was executed with the result
ru: Команда выполнена с результатом
tr: Komut sonuçla yürütüldü
zh_hans: 指令已执行，结果为

# bot.TelegramBridge.connected
source: Succesfully connected with the MCC!
ru: Успешно подключено к MCC!
tr: MCC ile başarıyla bağlandı!
zh_hans: 成功与 MCC 连接！

# bot.TelegramBridge.desc
source: This command allows you to specify in the which direction the messages will be relayed via the Telegram Bridge chat bot.
ru: Эта команда позволяет указать в каком направлении сообщения будут передаваться через чат-бот Телеграм бота.
tr: Bu komut, mesajların Telegram Bridge sohbet botu aracılığıyla hangi yönde iletileceğini belirlemenizi sağlar.
zh_hans: 这个指令允许你指定哪一个方向的信息会被Telegram Bridge转发。

# bot.TelegramBridge.direction
source: Direction of the Telegram Brdige has been switched to '{0}'!
ru: Направление Телеграм бота было переключено на '{0}'!
tr: Telegram Köprüsünün yönü '{0}' olarak değiştirildi!
zh_hans: Telegram Brdige信息转发方向已更改为 {0} ！

# bot.TelegramBridge.direction.both
source: Both
ru: Оба
tr: İkisi de
zh_hans: 全部

# bot.TelegramBridge.disconnected
source: Disconnected from from the MCC!
ru: Отключено от MCC!
tr: MCC ile bağlantı kesildi!
zh_hans: 成功与 MCC 断开连接！

# bot.TelegramBridge.invalid_direction
source: Invalid direction provided! Available directions: both|b, minecraft|mc, telegram|tg|t. Example: "tgbridge direction mc"
ru: Недопустимое направление! Доступные направления: как |b, minecraft|mc, telegram|tg|t. Пример: "tgbridge direction mc"
tr: Geçersiz yön sağlandı! Mevcut yönler: both|b, minecraft|mc, telegram|tg|t. Örnek: "tgbridge direction mc"
zh_hans: 无效的信息方向！可选：both|b，minecraft|mc，telegram|tg|t。例如："tgbridge direction mc"

# bot.TelegramBridge.missing_authorized_channels
source: [WARNING] You have not provided any Channel IDs, for "Authorized_Chat_Ids" field, anyone who finds your bot will be able to send messages and commands to it!
ru: [WARNING] Вы не указали ни одного ID канала, для поля "Authorized_Chat_Ids" любой, кто найдет вашего бота, сможет отправлять ему сообщения и команды!
tr: [WARNING] "Authorized_Chat_Ids" alanı için herhangi bir Kanal Kimliği sağlamadınız, botunuzu bulan herkes ona mesaj ve komut gönderebilecek!
zh_hans: [警告] 你未在 "Authorized_Chat_Ids" 字段提供任何的频道ID，任何找到你的机器人的人将能够对齐发送信息和指令！

# bot.TelegramBridge.missing_channel_id
source: [WARNING] You have not provided a Channel ID, you will ONLY get replies to commands sent from Telegram!
ru: [WARNING] Вы не предоставили ID канала, вы будете получать ответы на команды, отправленные через Телеграм!
tr: [WARNING] Kanal Kimliği sağlamadınız, SADECE Telegramdan gönderilen komutlara yanıt alacaksınız!
zh_hans: [警告] 你未提供频道ID，你将只会收到从Telegram发送的指令的回复！

# bot.TelegramBridge.missing_token
source: Please provide a valid bot token!
ru: Пожалуйста, укажите корректный телеграм бот токен!
tr: Lütfen geçerli bir bot token sağlayın!
zh_hans: 请提供有效的机器人令牌！

# bot.TelegramBridge.unauthorized
source: **🛑 Unauthorized access! 🛑 Add the ID of this chat to "Authorized_Chat_Ids" field in the configuration file to gain access!**
ru: **🛑 Неавторизованный доступ! 🛑 Добавьте ID этого чата в поле "Authorized_Chat_Ids" в файле конфигурации, чтобы получить доступ!**
tr: **🛑 Yetkisiz erişim! 🛑 Erişim kazanmak için bu sohbetin kimliğini yapılandırma dosyasındaki "Authorized_Chat_Ids" alanına ekleyin!**
zh_hans: **🛑 未授权的访问！ 🛑 将此频道的ID加到配置文档中的 "Authorized_Chat_Ids" 字段以获得访问授权！**

# bot.TelegramBridge.unknown_error
source: An unknown error has occured!
ru: Произошла неизвестная ошибка!
tr: Bilinmeyen bir hata oluştu!
zh_hans: 发生了未知错误 ！

# bot.testBot.said
source: Bot: {0} said : {1}
ru: Бот: {0} сказал: {1}
tr: Bot: {0} dedi ki: {1}
zh_hans: Bot：{0}说：{1}
zh_hant: Bot：{0}說：{1}

# bot.testBot.told
source: Bot: {0} told me : {1}
ru: Bot: {0} сказал мне : {1}
tr: Bot: {0} bana şunları söyledi: {1}
zh_hans: Bot：{0}对我说：{1}
zh_hant: Bot：{0}對我說：{1}

# botname.Alerts
source: Alerts
ru: Предупреждения
zh_hans: 提醒
zh_hant: 提醒

# botname.AutoAttack
source: AutoAttack
ru: Автоатака
zh_hans: 自动攻击
zh_hant: 自動攻擊

# botname.AutoCraft
source: AutoCraft
ru: Автокрафт
zh_hans: 自动合成
zh_hant: 自動合成

# botname.AutoDig
source: AutoDig
zh_hans: 自动挖掘
zh_hant: 自動挖掘

# botname.AutoDrop
source: AutoDrop
zh_hans: 自动丢弃
zh_hant: 自動丟棄

# botname.AutoEat
source: AutoEat
zh_hans: 自动进食
zh_hant: 自動進食

# botname.AutoFishing
source: AutoFishing
zh_hans: 自动钓鱼
zh_hant: 自動釣魚

# botname.AutoRelog
source: AutoRelog
zh_hans: 自动重连
zh_hant: 自動重連

# botname.AutoRespond
source: AutoRespond
zh_hans: 自动回复
zh_hant: 自動回覆

# botname.ChatLog
source: ChatLog
zh_hans: 聊天日志
zh_hant: 聊天日誌

# botname.Farmer
source: Farmer
zh_hans: 自动种植
zh_hant: 自動種植

# botname.FollowPlayer
source: FollowPlayer
zh_hans: 跟随玩家
zh_hant: 跟隨玩家

# botname.Mailer
source: Mailer
zh_hans: 邮差
zh_hant: 郵差

# botname.Map
source: Map
zh_hans: 地图
zh_hant: 地圖

# botname.PlayerListLogger
source: PlayerListLogger
zh_hans: 玩家列表记录

# botname.RemoteControl
source: RemoteControl
zh_hans: 远程控制

# botname.ReplayCapture
source: ReplayCapture
zh_hans: 回放捕捉

# botname.Script
source: Script
zh_hans: 脚本
zh_hant: 指令碼

# botname.TestBot
source: TestBot
zh_hans: 测试机器人

# cache.converting
source: Converting session cache from disk: {0}
ru: §8Преобразование кэша сессии с диска: {0}
tr: §8Oturum önbelleğini diskten dönüştürme: {0}
zh_hans: §8从磁盘转换会话缓存：{0}
zh_hant: §8從磁碟轉換會話快取：{0}

# cache.ignore_line
source: Ignoring invalid session token line: {0}
ru: §8Игнорирование недопустимой строки маркера сессии: {0}
tr: §8Geçersiz oturum belirteci satırı yoksayılıyor: {0}
zh_hans: §8忽略无效的会话令牌行：{0}
zh_hant: §8忽略無效的會話令牌行：{0}

# cache.ignore_line_keys
source: Ignoring invalid profile key token line: {0}
ru: §8Ignoring invalid profile key token line: {0}
tr: §8Geçersiz profil anahtarı token satırı yoksayılıyor: {0}
zh_hans: §8忽略无效的聊天签名密钥行：{0}
zh_hant: §8忽略無效的聊天簽名金鑰行：{0}

# cache.ignore_string
source: Ignoring session token string '{0}': {1}
ru: §8Игнорирование строки токена сессии '{0}': {1}
tr: §8'{0}' oturum belirteci dizesi yoksayılıyor: {1}
zh_hans: §8忽略会话令牌字符串'{0}'：{1}
zh_hant: §8忽略會話令牌字串'{0}'：{1}

# cache.ignore_string_keys
source: Ignoring profile key token string '{0}': {1}
ru: §8Ignoring profile key token string '{0}': {1}
tr: §8'{0}' profil anahtarı belirteci dizesi yoksayılıyor: {1}
zh_hans: §8忽略聊天签名密钥字符串 '{0}'：{1}
zh_hant: §8忽略聊天簽名金鑰字串 '{0}'：{1}

# cache.loaded
source: Loaded session: {0}:{1}
ru: §8Загруженная сессия: {0}:{1}
tr: §8Yüklenen oturum: {0}:{1}
zh_hans: §8已加载会话：{0}:{1}
zh_hant: §8已載入會話：{0}:{1}
