Repository: MCCTeam/Minecraft-Console-Client
Catalog: MinecraftClient/Resources/Translations/Translations.*.resx
Languages: ru, tr, zh_hans, zh_hant

# mcc.ip
source: Server IP :
ru: IP сервера:
tr: Sunucu Adresi:
zh_hans: 服务器IP：
zh_hant: 伺服器IP：

# mcc.joined
source: Server was successfully joined. Type '{0}quit' to leave the server.
ru: Сервер был успешно подключен. Type '{0}quit' для выхода из сервера.
tr: Sunucuya başarıyla bağlanıldı. Sunucudan çıkmak için '{0}quit' yazın.
zh_hans: 已成功加入服务器。 输入 '{0}quit' 离开服务器。
zh_hant: 已成功加入伺服器。 輸入 '{0}quit' 離開伺服器。

# mcc.link
source: Link: {0}
ru: Ссылка: {0}
tr: Bağlantı: {0}
zh_hans: 链接：{0}
zh_hant: 連結：{0}

# mcc.login
source: Login :
ru: Логин :
tr: Giriş :
zh_hans: 账户名：
zh_hant: 賬戶名：

# mcc.login_basic_io
source: Please type the username or email of your choice.
ru: Пожалуйста, введите имя пользователя или email по вашему выбору.
tr: Lütfen tercih ettiğiniz kullanıcı adını veya e-posta adresini yazın.
zh_hans: 请输入用户名或邮箱。
zh_hant: 請輸入使用者名稱或郵箱。

# mcc.not_found
source: Failed to perform SRV lookup for {0} {1}: {2}
ru: §8Failed to perform SRV lookup for {0} {1}: {2}
tr: §8{0} için SRV araması gerçekleştirilemedi {1}: {2}
zh_hans: §8无法执行{0}的SRV解析 {1}：{2}
zh_hant: §8無法執行{0}的SRV解析 {1}：{2}

# mcc.offline
source: You chose to run in offline mode.
ru: §8Вы выбрали запуск в автономном режиме.
tr: §8Çevrimdışı modda giriş yaptınız.
zh_hans: §8您正在使用离线模式。
zh_hant: §8您正在使用離線模式。

# mcc.password_basic_io
source: Please type the password for {0}.
ru: Пожалуйста, введите пароль для {0}.
tr: Lütfen {0} için şifreyi yazın.
zh_hans: 请输入用户 {0} 的密码。
zh_hant: 請輸入使用者 {0} 的密碼。

# mcc.password_hidden
source: Password(invisible):
ru: Пароль: {0}
tr: Password : {0}
zh_hans: 密码(不会显示)：{0}
zh_hant: 密碼(不會顯示)：{0}

# mcc.player_dead
source: You are dead. Type '{0}respawn' to respawn.
ru: Вы мертвы. Введите '{0}respawn', чтобы возродиться.
tr: Ölüsün. Yeniden doğmak için '{0}respawn' yazın.
zh_hans: 你死了！输入 '{0}respawn' 重生。
zh_hant: 你死了！輸入 '{0}respawn' 重生。

# mcc.player_dead_respawn
source: You are dead. Automatically respawning after 1 second.
ru: Вы мертвы. Автоматически возрождаетесь через 1 секунду.
tr: Ölüsün. 1 saniye sonra otomatik olarak yeniden doğacaksın.
zh_hans: 你死了！1秒后自动重生。
zh_hant: 你死了！1秒後自動重生。

# mcc.press_exit
source: Or press Enter to exit Minecraft Console Client.
ru: Нажмите Enter, чтобы выйти из консольного клиента Minecraft.
tr: Veya Minecraft Console Clientten çıkmak için Enter tuşuna basın.
zh_hans: 或者敲击回车退出Minecraft Console Client。
zh_hant: 或者敲擊回車退出Minecraft Console Client。

# mcc.profile_key_invalid
source: Cached profile key needs to be refreshed.
ru: §8Cached profile key needs to be refreshed.
tr: §8Önbelleğe alınmış profil anahtarının yenilenmesi gerekiyor.
zh_hans: §8缓存的聊天签名密钥需要刷新。
zh_hant: §8快取的聊天簽名金鑰需要重新整理。

# mcc.profile_key_valid
source: Cached profile key is still valid for {0}.
ru: §8Cached profile key is still valid for {0}.
tr: §8Önbelleğe alınmış profil anahtarı, {0} için hala geçerlidir.
zh_hans: §8{0}的聊天签名密钥缓存仍然有效.
zh_hant: §8{0}的聊天簽名金鑰快取仍然有效.

# mcc.realms_available
source: You have access to the following Realms worlds
ru: У вас есть доступ к следующим мирам Realms
tr: Aşağıdaki Realms dünyalarına erişiminiz var
zh_hans: #NAME?
zh_hant: #NAME?

# mcc.realms_join
source: Use realms:<index> as server IP to join a Realms world
ru: Используйте realms:index как IP сервера, чтобы присоединиться к миру Realms
tr: Realms dünyasına katılmak için realms:<index> sunucu IPsini kullanın
zh_hans: 请使用"realms:<序号>"作为服务器IP加入Realms世界
zh_hant: 請使用"realms:<序號>"作為伺服器IP加入Realms世界

# mcc.reconnect
source: Waiting 5 seconds ({0} attempts left)...
ru: Ожидание 5 секунд (осталось {0} попыток)...
tr: 5 saniye bekleniyor ({0} deneme kaldı)...
zh_hans: 等待5秒 (剩余{0}次尝试)...
zh_hant: 等待5秒 (剩餘{0}次嘗試)...

# mcc.resolve
source: Resolving {0}...
ru: Разрешение {0}...
tr: {0} çözümleniyor...
zh_hans: 正在解析{0}...
zh_hant: 正在解析{0}...

# mcc.restart
source: Restarting Minecraft Console Client...
ru: Перезапуск консольного клиента Minecraft...
tr: Minecraft Console Client Yeniden Başlatılıyor...
zh_hans: 正在重启Minecraft Console Client...
zh_hant: 正在重啟Minecraft Console Client...

# mcc.restart_delay
source: Waiting {0} seconds before restarting...
ru: Ожидание {0} секунд перед перезапуском...
tr: Yeniden başlatmadan önce {0} saniye bekleniyor...
zh_hans: 等待 {0} 秒后重启...
zh_hant: 等待 {0} 秒後重啟...

# mcc.retrieve
source: Retrieving Server Info...
ru: Получение информации о сервере...
tr: Sunucu Bilgileri Alınıyor...
zh_hans: 正在获取服务器信息...
zh_hant: 正在獲取伺服器資訊...

# mcc.run_with_default_settings
source: MCC is running with default settings.
tr: MCC varsayılan ayarlarla çalışıyor.
zh_hans: MCC正在使用默认配置运行。
zh_hant: MCC正在使用預設配置執行。

# mcc.server_offline
source: Server is in offline mode.
ru: §8Сервер находится в автономном режиме.
tr: §8Sunucu çevrimdışı modda.
zh_hans: §8服务器正处于离线模式。
zh_hant: §8伺服器正處於離線模式。

# mcc.server_protocol
source: Server version : {0} (protocol v{1})
ru: §8Версия сервера: {0} (протокол v{1})
tr: §8Sunucu sürümü : {0} (protokol v{1})
zh_hans: §8服务器的Minecraft版本：{0} (协议v{1})
zh_hant: §8伺服器的Minecraft版本：{0} (協議v{1})

# mcc.server_version
source: Server version :
ru: Версия сервера:
tr: Sunucu sürümü:
zh_hans: 服务器版本：
zh_hant: 伺服器版本：

# mcc.session
source: Checking Session...
ru: Проверка сессии...
tr: Oturum kontrol ediliyor...
zh_hans: 检查会话...
zh_hant: 檢查會話...

# mcc.session_fail
source: Failed to check session.
ru: Не удалось проверить сессию.
tr: Oturum kontrol edilemedi.
zh_hans: 检查会话失败
zh_hant: 檢查會話失敗

# mcc.session_invalid
source: Cached session is invalid or expired.
ru: §8Кэшированная сессия недействительна или истекла.
tr: §8Önbelleğe alınmış oturum geçersiz veya süresi dolmuş.
zh_hans: §8会话缓存无效或已过期。
zh_hant: §8會話快取無效或已過期。

# mcc.session_valid
source: Cached session is still valid for {0}.
ru: §8Кэшированная сессия все еще действительна для {0}.
tr: §8Önbelleğe alınmış oturum, {0} için hala geçerlidir.
zh_hans: §8{0}的会话缓存仍然有效。
zh_hant: §8{0}的會話快取仍然有效。

# mcc.settings_generated
source: Settings file MinecraftClient.ini has been generated.
ru: §cSettings file MinecraftClient.ini has been generated.
tr: §cAyar dosyası MinecraftClient.ini oluşturuldu.
zh_hans: §c配置文件 MinecraftClient.ini 已经生成。
zh_hant: §c配置檔案 MinecraftClient.ini 已經生成。

# mcc.unknown_version
source: Unknown or not supported MC version {0}. Switching to autodetection mode.
ru: §8Неизвестная или не поддерживаемая версия MC {0}. Переключение в режим автоопределения.
tr: §8Bilinmeyen veya desteklenmeyen MC sürümü {0}. Otomatik algılama moduna geçiş.
zh_hans: §8未知或不受支持的Minecraft版本{0}。 正在切换至自动检测模式。
zh_hant: §8未知或不受支援的Minecraft版本{0}。 正在切換至自動檢測模式。

# mcc.use_version
source: Using Minecraft version {0} (protocol v{1})
ru: §8Используется Minecraft версии {0} (протокол v{1})
tr: §8Minecraft {0} sürümü kullanılıyor (protokol v{1})
zh_hans: §8正在运行Minecraft版本{0} (v{1}协议)
zh_hant: §8正在執行Minecraft版本{0} (v{1}協議)

# mcc.version_supported
source: Version is supported. Logging in...
ru: Версия поддерживается. Войти в игру...
tr: Sürüm destekleniyor. Giriş yapılıyor...
zh_hans: 该版本受到支持 正在登录...
zh_hant: 該版本受到支援 正在登入...

# mcc.with_forge
source: , with Forge
ru: , с Forge
tr: , Forgeu ile
zh_hans: , 带有Forge
zh_hant: , 帶有Forge

# proxy.connected
source: Connected to proxy {0}:{1}
ru: §8Подключен к прокси {0}:{1}
tr: §8{0}:{1} adresine bağlanılıyor
zh_hans: §8已连接到代理{0}:{1}
zh_hant: §8已連線到代理{0}:{1}

# cmd.setrnd.format
source: setrnd variable -7 to 17 OR setrnd variable string1 "\"string2\" string3"
zh_hans: setrnd variable -7to17 或 setrnd variable string1 "\"string2\" string3"

# exception.palette.healthfield
source: Please update health field handling for this Minecraft version.
tr: Lütfen bu Minecraft sürümü için sağlık alanı işlemeyi güncelleyin.
zh_hans: 请为此Minecraft版本更新实体生命值字段处理。

# bot.DiscordBridge.disconnected
source: Successfully disconnected with MCC!
tr: MCC ile bağlantınız başarılı bir şekilde kesildi!
zh_hans: 成功断开与 MCC的连接！

# cmd.execmulti.prevent
source: You can not use execmulti or execif within execmulti command!
tr: Execmulti komuduyla execmulti ya da execif kullanamazsınız!
zh_hans: 你不能在 execmulti 指令中使用 execmulti 或 execif 指令

# cmd.move.desc_force
source: force unsafe movements like falling or touching fire
tr: düşme ve ateşe değme gibi güvenli olmayan haraketlere zorla
zh_hans: 允许不安全的移动，例如掉落或触碰火

# bot.autodig.no_inv_handle
source: Inventory handling is not enabled. Unable to switch tools automatically.
tr: Inventory handling aktif değil. Aletler otomatik değiştirilemiyor.
zh_hans: 库存处理未启用。无法自动切换工具。

# mcc.use_new_config
source: Please use the newly generated MinecraftClient.ini
tr: Lütfen yeni oluşturulan MinecraftClient.ini dosyasını kullanınız.
zh_hans: 请使用新生成的 MinecraftClient.ini

# mcc.backup_old_config
source: The old MinecraftClient.ini has been backed up as {0}
tr: Eski MinecraftClient.ini dosyası {0} olarak yedeklendi
zh_hans: 已将旧的 MinecraftClient.ini 备份为 {0}

# bot.DiscordBridge.direction.discord
source: Discord
ru: Дискорд

# bot.DiscordBridge.direction.minecraft
source: Minecraft
ru: Майнкрафт

# bot.TelegramBridge.direction.minecraft
source: Minecraft
ru: Майнкрафт

# bot.TelegramBridge.direction.Telegram
source: Telegram
ru: Телеграм

# botname.AntiAFK
source: AntiAFK
ru: АнтиАФК
