Repository: MCCTeam/Minecraft-Console-Client
Catalog: MinecraftClient/Resources/Translations/Translations.*.resx
Languages: ru, tr, zh_hans, zh_hant

# error.forge_encrypt
source: Forge StartEncryption Handshake did not complete successfully
ru: §8Forge StartEncryption Handshake не завершилось успешно
tr: §8Forge StartEncryption El Sıkışma başarıyla tamamlanmadı
zh_hans: §8Forge StartEncryption握手未成功完成
zh_hant: §8Forge StartEncryption握手未成功完成

# error.forgeforce
source: Cannot force Forge support for this Minecraft version!
ru: Не удается принудительно включить поддержку Forge для этой версии Minecraft!
tr: Bu Minecraft sürümü için Forge desteği zorlanamaz!
zh_hans: 无法为此Minecraft版本强制启动Forge支持！
zh_hant: 無法為此Minecraft版本強制啟動Forge支援！

# error.generator.invalid
source: Invalid usage of the generator command!
tr: Jeneratör komutunun geçersiz kullanımı!
zh_hans: 该生成器命令用法无效！
zh_hant: 該生成器命令用法無效！

# error.generator.json
source: The provided path must be a path to a file that is in .json format!
tr: Sağlanan yol, .json biçiminde bir dosyanın yolu olmalıdır!
zh_hans: 提供的路径必须指向一个.json格式的文件!
zh_hant: 提供的路徑必須指向一個.json格式的檔案!

# error.generator.path
source: Invalid data path provided! (The path either does not exists or you have made a typo)
tr: Geçersiz veri yolu sağlandı! (Yol yok ya da yazım hatası yaptınız)
zh_hans: 提供的数据路径无效! (路径不存在或是输入错误）
zh_hant: 提供的資料路徑無效! (路徑不存在或是輸入錯誤）

# error.http_code
source: Got error code from server: {0}
ru: §8Получен код ошибки от сервера: {0}
tr: §8Sunucudan hata kodu alındı: {0}
zh_hans: §8接收到服务器错误：{0}
zh_hant: §8接收到伺服器錯誤：{0}

# error.invalid_encrypt
source: Invalid response to StartEncryption packet
ru: §8Неправильный ответ на пакет StartEncryption
tr: §8StartEncryption paketine geçersiz yanıt
zh_hans: §8对StartEncryption数据包的响应无效
zh_hant: §8對StartEncryption資料包的響應無效

# error.invalid_response
source: Invalid response to Handshake packet
ru: §8Неправильный ответ на пакет Handshake
tr: §8El Sıkışma paketine geçersiz yanıt
zh_hans: §8对握手包的响应无效
zh_hant: §8對握手包的響應無效

# error.inventoryhandling_not_enabled
source: This feature requires Inventory Handling to be enabled in order to work!
tr: Bu özelliğin çalışması için Inventory Handling özelliğinin etkinleştirilmesi gerekir!
zh_hans: 此功能需要启用库存处理才能工作 ！

# error.join
source: An error occured when attempting to join this server.
ru: Не удалось подключиться к этому серверу.
tr: Bu sunucuya katılmaya çalışırken bir hata oluştu.
zh_hans: 加入服务器时发生错误。
zh_hant: 加入伺服器時發生錯誤。

# error.login
source: Login failed :
ru: Не удалось войти в систему Minecraft :
tr: Giriş başarısız :
zh_hans: 登录失败：
zh_hant: 登入失敗：

# error.login.blocked
source: Incorrect username/password, blacklisted IP or too many logins.
ru: Неправильный пароль, IP из черного списка или слишком много логинов.
tr: Yanlış kullanıcı adı/şifre, kara listeye alınmış IP veya çok fazla oturum açma.
zh_hans: 用户名/密码错误、IP被禁用或登录次数过多。
zh_hant: 使用者名稱/密碼錯誤、IP被禁用或登入次數過多。

# error.login.cancel
source: User cancelled.
ru: Пользователь отменен.
tr: Kullanıcı iptal edildi.
zh_hans: 用户取消。
zh_hant: 使用者取消。

# error.login.migrated
source: Account migrated, use e-mail as username.
ru: Аккаунт перенесен, используйте e-mail в качестве имени пользователя.
tr: Hesap değişti, kullanıcı adı olarak mail adresi kullan.
zh_hans: 帐户已迁移，请使用电子邮件作为用户名。
zh_hant: 帳戶已遷移，請使用電子郵件作為使用者名稱。

# error.login.network
source: Network error.
ru: Ошибка сети.
tr: Network hata.
zh_hans: 网络错误。
zh_hant: 網路錯誤。

# error.login.premium
source: User not premium.
ru: Пользователь не премиум-класса.
tr: Kullanıcı premium değil.
zh_hans: 不是Premium用户。
zh_hant: 不是Premium使用者。

# error.login.response
source: Invalid server response.
ru: Неправильный ответ сервера.
tr: Geçersiz sunucu yanıtı.
zh_hans: 服务器返回了无效的响应。
zh_hant: 伺服器返回了無效的響應。

# error.login.server
source: Login servers are unavailable. Please try again later.
ru: Серверы входа недоступны. Пожалуйста, повторите попытку позже.
tr: Giriş sunucuları kullanılamıyor. Lütfen daha sonra tekrar deneyiniz.
zh_hans: 登录服务器不可用。请稍后再试。
zh_hant: 登入伺服器不可用。請稍後再試。

# error.login.ssl
source: SSL Error.
ru: Ошибка SSL.
tr: SSL hata.
zh_hans: SSL错误。
zh_hant: SSL錯誤。

# error.login.unknown
source: Unknown Error.
ru: Неизвестная ошибка.
tr: Bilinmeyen hata.
zh_hans: 未知错误。
zh_hant: 未知錯誤。

# error.login_failed
source: Failed to login to this server.
ru: Не удалось войти на этот сервер.
tr: Bu sunucuda oturum açılamadı.
zh_hans: 无法登录到此服务器。
zh_hant: 無法登入到此伺服器。

# error.missing.argument
source: You are missing argument {0}
tr: {0} bağımsız değişkenini kaçırıyorsunuz
zh_hans: 缺少参数 {0}
zh_hant: 缺少引數 {0}

# error.no_version_report
source: Server does not report its protocol version, autodetection will not work.
ru: §8Сервер не сообщает версию своего протокола, автоопределение не работает.
tr: §8Sunucu protokol sürümünü bildirmiyor, otomatik algılama çalışmayacak.
zh_hans: §8服务器未报告其协议版本，自动检测将不起作用。
zh_hant: §8伺服器未報告其協議版本，自動檢測將不起作用。

# error.ping
source: Failed to ping this IP.
ru: Не удалось выполнить ping этого IP.
tr: Bu IPye ping atılamadı.
zh_hans: ping此IP失败。
zh_hant: ping此IP失敗。

# error.realms.access_denied
source: This Realms world does not exist or access was denied
ru: Этот мир Realms не существует или доступ был запрещен
tr: Bu Realms dünyası mevcut değil veya erişim reddedildi
zh_hans: 此Realms世界不存在或访问被拒绝
zh_hant: 此Realms世界不存在或訪問被拒絕

# error.realms.disabled
source: Trying to join a Realms world but Realms support is disabled in config
ru: Попытка присоединиться к миру Realms, но поддержка Realms отключена в конфигурации
tr: Bir Realms dünyasına katılmaya çalışıyorum ancak Realms desteği yapılandırmada devre dışı bırakıldı
zh_hans: 正在尝试加入Realms世界，但配置中禁用了Realms支持
zh_hant: 正在嘗試加入Realms世界，但配置中禁用了Realms支援

# error.realms.ip_error
source: Cannot retrieve the server IP of your Realms world
ru: Невозможно получить IP-адрес сервера вашего мира Realms
tr: Realms dünyanızın sunucu IPsi alınamıyor
zh_hans: 无法获取您Realms世界的服务器IP
zh_hant: 無法獲取您Realms世界的伺服器IP

# error.realms.server_id
source: Invalid or unknown Realms server ID.
ru: Неверный или неизвестный идентификатор сервера Realms.
tr: Geçersiz veya bilinmeyen Realms sunucu kimliği.
zh_hans: Realms服务器ID无效或未知。
zh_hant: Realms伺服器ID無效或未知。

# error.realms.server_unavailable
source: Realms server may require some time to start up. Please retry again later.
ru: Серверу Realms может потребоваться некоторое время для запуска. Пожалуйста, повторите попытку позже.
tr: Realms sunucusunun başlatılması biraz zaman alabilir. Lütfen daha sonra tekrar deneyin.
zh_hans: Realms服务器可能需要一些时间来启动。请稍后再试。
zh_hant: Realms伺服器可能需要一些時間來啟動。請稍後再試。

# error.setting.argument_syntax
source: {0}: Invalid syntax, expecting --argname=value or --section.argname=value
ru: {0}: Неверный синтаксис, ожидается --argname=value или --section.argname=value
tr: {0}: Geçersiz sözdizimi, bekleniyor --argname=value veya --section.argname=value
zh_hans: {0}：无效语法，应为 --argname=value 或 --section.argname=value
zh_hant: {0}：無效語法，應為 --argname=value 或 --section.argname=value

# error.terrain_not_enabled
source: This feature requires Terrain And Movements to be enabled in order to work!
tr: Bu özelliğin çalışması için Terrain and Movements özelliğini etkinleştirin!
zh_hans: 此功能需要启用地形处理才能工作 ！

# error.timeout
source: Connection Timeout
ru: Таймаут соединения
tr: Bağlantı zamanaşımı
zh_hans: 连接超时
zh_hant: 連線超時

# error.unexpect_response
source: Unexpected response from the server (is that a Minecraft server?)
ru: §8Неожиданный ответ от сервера (это сервер Minecraft?).
tr: §8Sunucudan beklenmeyen yanıt (bu bir Minecraft sunucusu mu?)
zh_hans: §8来自服务器的意外响应（这是Minecraft服务器吗？）
zh_hant: §8來自伺服器的意外響應（這是Minecraft伺服器嗎？）

# error.unsupported
source: Cannot connect to the server : This version is not supported !
ru: Не удается подключиться к серверу: эта версия не поддерживается!
tr: Sunucuya bağlanılamıyor: Bu sürüm desteklenmiyor!
zh_hans: 无法连接到服务器：不支持此版本！
zh_hant: 無法連線到伺服器：不支援此版本！

# error.usage
source: Usage:
ru: Применение:
tr: Kullanım:
zh_hans: 使用方法：
zh_hant: 使用方法：

# error.version_different
source: Server reports a different version than manually set. Login may not work.
ru: §8Сервер сообщает о версии, отличной от установленной вручную. Вход в систему может не работать.
tr: §8Sunucu, manuel olarak ayarlanandan farklı bir sürüm bildiriyor. Giriş çalışmayabilir.
zh_hans: §8服务器报告的版本与手动设置的版本不同。登录可能无法工作。
zh_hant: §8伺服器報告的版本與手動設定的版本不同。登入可能無法工作。

# exception.chatbot.init
source: ChatBot methods should NOT be called in the constructor as API handler is not initialized yet. Override Initialize() or AfterGameJoined() instead to perform initialization tasks.
ru: Методы ChatBot НЕ должны вызываться в конструкторе, так как обработчик API еще не инициализирован. Вместо этого переопределите Initialize() или AfterGameJoined() для выполнения задач инициализации.
tr: API işleyicisi henüz başlatılmadığından, yapıcıda ChatBot yöntemleri çağrılmamalıdır. Başlatma görevlerini gerçekleştirmek için Initialize() veya AfterGameJoined() öğelerini geçersiz kılın.
zh_hans: 不应在构造函数中调用ChatBot的方法，因为作为API处理程序的模块尚未初始化。请重写 Initialize() 或 AfterGameJoined() 来执行初始化任务。
zh_hant: 不應在建構函式中呼叫ChatBot的方法，因為作為API處理程式的模組尚未初始化。請重寫 Initialize() 或 AfterGameJoined() 來執行初始化任務。

# exception.csrunner.invalid_head
source: The provided script does not have a valid MCCScript header
ru: Предоставленный скрипт не имеет действительного заголовка MCCScript
tr: Sağlanan komut dosyası geçerli bir MCCScript başlığına sahip değil
zh_hans: 提供的脚本没有有效的MCCScript头
zh_hant: 提供的指令碼沒有有效的MCCScript頭

# exception.packet_process
source: Failed to process incoming packet of type {0}. (PacketID: {1}, Protocol: {2}, LoginPhase: {3}, InnerException: {4}).
ru: Не удалось обработать входящий пакет типа {0}. (PacketID: {1}, Protocol: {2}, LoginPhase: {3}, InnerException: {4}).
tr: {0} türünden gelen paket başarısız oldu. (PacketID: {1}, Protokol: {2}, LoginPhase: {3}, InnerException: {4}).
zh_hans: 无法处理传入的{0}类型的数据包。(数据包ID：{1}，协议：{2}，登陆阶段：{3}，内部异常：{4})。
zh_hant: 無法處理傳入的{0}型別的資料包。(資料包ID：{1}，協議：{2}，登陸階段：{3}，內部異常：{4})。

# exception.palette.block
source: Please update block types handling for this Minecraft version. See Material.cs
ru: Пожалуйста, обновите обработку типов блоков для этой версии Minecraft. См. Material.cs
tr: Lütfen bu Minecraft sürümü için blok türleri işlemeyi güncelleyin. Material.cs e bakın
zh_hans: 请为此Minecraft版本更新方块类型处理。详细请参考 Material.cs
zh_hant: 請為此Minecraft版本更新方塊型別處理。詳細請參考 Material.cs

# exception.palette.entity
source: Please update entity types handling for this Minecraft version. See EntityType.cs
ru: Пожалуйста, обновите обработку типов сущностей для этой версии Minecraft. См. EntityType.cs
tr: Lütfen bu Minecraft sürümü için varlık türlerini işlemeyi güncelleyin. EntityType.cs e bakın
zh_hans: 请为此Minecraft版本更新实体类型处理。详细请参考 EntityType.cs
zh_hant: 請為此Minecraft版本更新實體型別處理。詳細請參考 EntityType.cs

# exception.palette.item
source: Please update item types handling for this Minecraft version. See ItemType.cs
ru: Пожалуйста, обновите обработку типов элементов для этой версии Minecraft. См. ItemType.cs
tr: Lütfen bu Minecraft sürümü için öğe türlerini işlemeyi güncelleyin. ItemType.cs e bakın
zh_hans: 请为此Minecraft版本更新物品类型处理。详细请参考 ItemType.cs
zh_hant: 請為此Minecraft版本更新物品型別處理。詳細請參考 ItemType.cs

# exception.palette.packet
source: Please update packet type palette for this Minecraft version. See PacketTypePalette.cs
ru: Пожалуйста, обновите палитру типов пакетов для этой версии Minecraft. См. PacketTypePalette.cs
tr: Lütfen bu Minecraft sürümü için paket türü paletini güncelleyin. PacketTypePalette.cs e bakın
zh_hans: 请为此Minecraft版本更新数据包类型调色板。详细请参考 PacketTypePalette.cs
zh_hant: 請為此Minecraft版本更新資料包型別調色盤。詳細請參考 PacketTypePalette.cs

# exception.unknown_direction
source: Unknown direction
ru: Неизвестное направление
tr: Bilinmeyen yön
zh_hans: 未知方向
zh_hant: 未知方向

# exception.user_logout
source: User-initiated logout should be done by calling Disconnect()
ru: Инициированный пользователем выход из системы должен быть выполнен вызовом Disconnect()
tr: Kullanıcı tarafından başlatılan çıkış, Disconnect() çağrılarak yapılmalıdır.
zh_hans: 用户发起的注销应该通过调用Disconnect()来完成
zh_hant: 使用者發起的登出應該通過呼叫Disconnect()來完成

# exception.version_unsupport
source: The protocol version no.{0} is not supported.
ru: Версия протокола № {0} не поддерживается.
tr: {0} numaralı protokol sürümü desteklenmiyor.
zh_hans: 版本{0}的协议未被支持。
zh_hant: 版本{0}的協議未被支援。

# extra.entity_disabled
source: Entities are currently not handled for that MC version.
ru: §cСущности в настоящее время не обрабатываются для данной версии MC.
tr: §cVarlıklar şu anda bu MC sürümü için kullanılmamakta.
zh_hans: §c该MC版本当前还不支持处理实体。
zh_hant: §c該MC版本當前還不支援處理實體。

# extra.entity_required
source: Please enable EntityHandling in the config file first.
ru: Пожалуйста, сначала включите EntityHandling в конфигурационном файле.
tr: Lütfen önce ayar dosyasında EntityHandling özelliğini etkinleştirin.
zh_hans: 请先在配置文件中启用"Main.Advanced.entity_handling"。
zh_hant: 請先在配置檔案中啟用"Main.Advanced.entity_handling"。

# extra.inventory_close
source: Inventory # {0} closed.
ru: Инвентарь # {0} закрыт.
tr: Envanter # {0} kapatıldı.
zh_hans: 容器# {0}已关闭。
zh_hant: 容器# {0}已關閉。

# extra.inventory_disabled
source: Inventories are currently not handled for that MC version.
ru: §cВ настоящее время инвентарь не обрабатывается для данной версии MC.
tr: §cEnvanterler şu anda bu MC sürümü için kullanılmamakta.
zh_hans: §c该MC版本目前未支持处理库存(物品)。
zh_hant: §c該MC版本目前未支援處理庫存(物品)。

# extra.inventory_enabled
source: Inventory handling is now enabled.
ru: Обработка инвентаря теперь включена.
tr: Envanter işleme artık etkinleştirildi.
zh_hans: 库存(物品)处理现在已启用。
zh_hant: 庫存(物品)處理現在已啟用。

# extra.inventory_interact
source: Use /inventory to interact with it.
ru: Используйте /inventory для взаимодействия с ним.
tr: Onunla etkileşim kurmak için /inventory kullanın.
zh_hans: 请使用 /inventory 来与其交互。
zh_hant: 請使用 /inventory 來與其互動。

# extra.inventory_open
source: Inventory # {0} opened: {1}
ru: Инвентарь # {0} открыт: {1}
tr: Envanter # {0} açıldı: {1}
zh_hans: 容器# {0}已开启：{1}
zh_hant: 容器# {0}已開啟：{1}

# extra.inventory_required
source: Please enable InventoryHandling in the config file first.
ru: Пожалуйста, сначала включите InventoryHandling в конфигурационном файле.
tr: Lütfen önce ayar dosyasında InventoryHandling özelliğini etkinleştirin.
zh_hans: 请先在配置文件中启用"Main.Advanced.inventory_handling"。
zh_hant: 請先在配置檔案中啟用"Main.Advanced.inventory_handling"。

# extra.terrainandmovement_disabled
source: Terrain & Movements currently not handled for that MC version.
ru: §cTerrain & Movements в настоящее время не обрабатываются для данной версии MC.
tr: §cTerrain and Movements bu MC sürümü için kullanılmamakta.
zh_hans: §c该游戏版本目前还不支持地形和移动处理。
zh_hant: §c該遊戲版本目前還不支援地形和移動處理。

# extra.terrainandmovement_enabled
source: Terrain and Movements is now enabled.
ru: Территория и перемещения теперь включены.
tr: Terrain and Movements artık aktif.
zh_hans: 地形和移动处理现在已启用。
zh_hant: 地形和移動處理現在已啟用。

# extra.terrainandmovement_required
source: Please enable Terrain and Movements in the config file first.
ru: Пожалуйста, сначала включите Terrain и Movements в конфигурационном файле.
tr: Lütfen önce ayar dosyasında Terrain and Movements etkinleştirin.
zh_hans: 请先在配置文件中启用地形和移动处理。
zh_hant: 請先在配置檔案中啟用地形和移動處理。

# filemonitor.fail
source: [{0}] Failed to initialize FileSystemWatcher, retrying using Polling
ru: §8[{0}] Не удалось инициализировать FileSystemWatcher, повторная попытка с использованием опроса
tr: §8[{0}] FileSystemWatcher başlatılamadı, Polling kullanılarak yeniden denendi
zh_hans: §8[{0}] 无法初始化FileSystemWatcher，正在使用轮询重试
zh_hant: §8[{0}] 無法初始化FileSystemWatcher，正在使用輪詢重試

# filemonitor.init
source: [{0}] Initializing FileSystemWatcher for file: {1}
ru: §8[{0}] Инициализация FileSystemWatcher для файла: {1}
tr: §8[{0}] Dosya için FileSystemWatcher başlatılıyor: {1}
zh_hans: §8[{0}] 正在为文件{1}初始化FileSystemWatcher
zh_hant: §8[{0}] 正在為檔案{1}初始化FileSystemWatcher

# forge.accept
source: Accepting server mod list...
ru: §8Принятие списка модов сервера...
tr: §8Sunucu mod listesi kabul ediliyor...
zh_hans: §8接受来自的服务器模组列表...
zh_hant: §8接受來自的伺服器模組列表...

# forge.accept_registry
source: Accepting server registries...
ru: §8Принятие реестров сервера...
tr: §8Sunucu kayıtları kabul ediliyor...
zh_hans: §8接受服务器注册表...
zh_hant: §8接受伺服器登錄檔...

# forge.complete
source: Forge server connection complete!
ru: Подключение к серверу завершено!
tr: Sahte sunucu bağlantısı tamamlandı!
zh_hans: Forge服务器连接完成!
zh_hant: Forge伺服器連線完成!

# forge.fml2.config
source: Acknowledging FML2 Server Config: {0}
ru: §8Подтверждение конфигурации сервера FML2: {0}
tr: §8FML2 Sunucu Yapılandırması Onaylanıyor: {0}
zh_hans: §8确认FML2服务器配置：{0}
zh_hant: §8確認FML2伺服器配置：{0}

# forge.fml2.mod
source: Received FML2 Server Mod List
ru: §8Получение списка модов сервера FML2
tr: §8Alınan FML2 Sunucu Mod Listesi
zh_hans: §8收到FM2服务器模组列表
zh_hant: §8收到FM2伺服器模組列表

# forge.fml2.mod_send
source: Sending back FML2 Client Mod List
ru: §8Отправка списка модов клиента FML2
tr: §8FML2 İstemci Mod Listesini Geri Gönderme
zh_hans: §8发回FML2客户端的模组列表
zh_hant: §8發回FML2客戶端的模組列表

# forge.fml2.registry
source: Acknowledging FML2 Server Registry: {0}
ru: §8Подтверждение реестра сервера FML2: {0}
tr: §8FML2 Sunucu Kaydının Onaylanması: {0}
zh_hans: §8确认FML2服务器注册表：{0}
zh_hant: §8確認FML2伺服器登錄檔：{0}

# forge.fml2.unknown
source: Got Unknown FML2 Handshake message no. {0}
ru: §8Got Unknown FML2 Handshake message no. {0}
tr: §8Bilinmeyen FML2 Handshake mesajı var no. {0}
zh_hans: §8收到未知的FML2握手信息，编号：{0}
zh_hant: §8收到未知的FML2握手資訊，編號：{0}

# forge.fml2.unknown_channel
source: Ignoring Unknown FML2 LoginMessage channel: {0}
ru: §8Игнорирование канала неизвестного сообщения FML2 LoginMessage: {0}
tr: §8Bilinmeyen FML2 LoginMessage kanalı yoksayılıyor: {0}
zh_hans: §8忽略未知的FML2登录消息通道：{0}
zh_hant: §8忽略未知的FML2登入訊息通道：{0}

# forge.mod_list
source: Mod list:
ru: §8Список модов:
tr: §8Mod listesi:
zh_hans: §8模组列表:
zh_hant: §8模組列表:

# forge.no_mod
source: Server is running Forge without mods.
ru: §8На сервере запущен Forge без модов.
tr: §8Sunucuya Forge kullanılmadan giriş yapılıyor.
zh_hans: §8正在运行的服务器没有Forge模组。
zh_hant: §8正在執行的伺服器沒有Forge模組。

# forge.registry
source: Received registry with {0} entries
ru: §8Получен реестр с {0} записями
tr: §8{0} girişli kayıt alındı
zh_hans: §8已接收的注册表包含{0}个条目
zh_hant: §8已接收的登錄檔包含{0}個條目

# forge.registry_2
source: Received registry {0} with {1} entries
ru: §8Получен реестр {0} с {1} записями
tr: §8{1} girişli {0} kayıt defteri alındı
zh_hans: §8已接收注册表{0}，包含{1}个条目
zh_hant: §8已接收登錄檔{0}，包含{1}個條目

# forge.send_mod
source: Sending falsified mod list to server...
ru: §8Отправка фальсифицированного списка модов на сервер...
tr: §8Sahte mod listesi sunucuya gönderiliyor...
zh_hans: §8向服务器发送伪造的forge模组列表...
zh_hant: §8向伺服器傳送偽造的forge模組列表...

# forge.version
source: Forge protocol version : {0}
ru: §8Версия протокола Forge : {0}
tr: §8Forge protokolü sürümü: {0}
zh_hans: §8Forge协议版本：{0}
zh_hant: §8Forge協議版本：{0}

# forge.with_mod
source: Server is running Forge with {0} mods.
ru: §8На сервере запущен Forge с {0} модами.
tr: §8{0} Forge modu ile giriş yapılıyor.
zh_hans: §8服务器正在运行Forge，有{0}个模组。
zh_hant: §8伺服器正在執行Forge，有{0}個模組。

# general.available_cmd
source: Available commands: {0}
ru: Доступные команды: {0}
tr: Kullanılabilir komutlar: {0}
zh_hans: 可用命令：{0}
zh_hant: 可用命令：{0}

# general.bot_unload
source: This bot will be unloaded.
ru: Этот бот будет выгружен.
tr: Bu bot kaldırılacak.
zh_hans: 将会卸载此bot。
zh_hant: 將會解除安裝此bot。

# general.done
source: Done
tr: Tamamlandı
zh_hans: 完成
zh_hant: 完成

# general.fail
source: Fail
ru: Не удалось
tr: Başarısız
zh_hans: 失败
zh_hant: 失敗

# icmd.error
source: OnInternalCommand: Got error from {0}: {1}
ru: OnInternalCommand: Получена ошибка от {0}: {1}
tr: OnInternalCommand: {0} kaynağından hata alındı: {1}
zh_hans: OnInternalCommand: 来自{0}的错误{1}
zh_hant: OnInternalCommand: 來自{0}的錯誤{1}

# icmd.help
source: help <cmdname>: show brief help about a command.
ru: help <имя команды>: показать краткую справку о команде.
tr: help <cmdname>: bir komut hakkında kısa yardım göster.
zh_hans: help <命令名称> ：显示有关命令的简要帮助。
zh_hant: help <命令名稱> ：顯示有關命令的簡要幫助。

# icmd.list
source: help <cmdname>. Available commands: {0}For server help, use '{1}send /help' instead.
ru: help <имя команды>. Доступные команды: {0}. Для получения справки по серверу используйте '{1}send /help'.
tr: help <cmdname>. Kullanılabilir komutlar: {0}. Sunucu yardımı için bunun yerine '{1}/help' kullanın.
zh_hans: help <命令名称>。可用命令：{0}。在服务器上获取帮助，请改用 '{1}send /help'。
zh_hant: help <命令名稱>。可用命令：{0}。在伺服器上獲取幫助，請改用 '{1}send /help'。

# icmd.unknown
source: Unknown command '{0}'. Use 'help' for command list.
ru: Неизвестная команда '{0}'. Используйте 'help' для списка команд.
tr: Bilinmeyen komut '{0}'. Komut listesi için 'help' kullanın.
zh_hans: 未知命令 '{0}'。请使用 'help' 命令来获取命令列表。
zh_hant: 未知命令 '{0}'。請使用 'help' 命令來獲取命令列表。

# mcc.connecting
source: Connecting to {0}...
ru: Подключение к {0}...
tr: {0} Bağlanılıyor...
zh_hans: 正在连接至{0}...
zh_hant: 正在連線至{0}...

# mcc.disconnect.login
source: Login failed :
ru: Войти не удалось:
tr: Giriş başarısız :
zh_hans: 连接失败：
zh_hant: 連線失敗：

# mcc.disconnect.lost
source: Connection has been lost.
ru: Соединение было потеряно.
tr: Bağlantı kesildi.
zh_hans: 失去连接。
zh_hant: 失去連線。

# mcc.disconnect.server
source: Disconnected by Server :
ru: Отключен сервером:
tr: Sunucuyla bağlantı koptu :
zh_hans: 从服务器断开连接：
zh_hant: 從伺服器斷開連線：

# mcc.disconnected
source: Not connected to any server. Use '{0}help' for help.
ru: Не подключен ни к одному серверу. Используйте '{0}help' для получения справки.
tr: Herhangi bir sunucuya bağlı değil. Yardım için '{0}help' kullanın.
zh_hans: 未连接至任何服务器。输入 '{0}help' 获得帮助。
zh_hant: 未連線至任何伺服器。輸入 '{0}help' 獲得幫助。

# mcc.fetching_key
source: Fetching profile key from Microsoft.
tr: Microsofttan profil anahtarı alınıyor.
zh_hans: 正在从微软获取聊天签名密钥。
zh_hant: 正在從微軟獲取聊天簽名金鑰。

# mcc.forge
source: Checking if server is running Forge...
ru: Проверка, запущен ли на сервере Forge...
tr: Sunucunun Forge ile çalışıp çalışmadığı kontrol ediliyor...
zh_hans: 检查服务器是否正在运行Forge...
zh_hant: 檢查伺服器是否正在執行Forge...

# mcc.forgeforce
source: Force-enabling Forge support.
ru: Включение поддержки Forge.
tr: Forge desteğini zorla etkinleştirme.
zh_hans: 正在强制启动Forge支持。
zh_hant: 正在強制啟動Forge支援。

# mcc.found
source: Found server {0}:{1} for domain {2}
ru: §8Найден сервер {0}:{1} для домена {2}
tr: §8{2} domaini için {0}:{1} sunucusu bulundu
zh_hans: §8已找到服务器{0}:{1}，域名：{2}
zh_hant: §8已找到伺服器{0}:{1}，域名：{2}

# mcc.gen_new_config
source: New configuration file "{0}" is generated.
tr: Yeni yapılandırma dosyası "{0}" oluşturuldu.
zh_hans: 已生成新的配置文件 "{0}" 。
zh_hant: 已生成新的配置檔案 "{0}" 。

# mcc.generator.done
source: Succesfully generated {0} palette using the dataset: {1}
tr: Veri kümesi kullanılarak {0} paleti başarıyla oluşturuldu: {1}
zh_hans: 已完成从 {0} 信息生成，使用 {1}
zh_hant: 已完成從 {0} 資訊生成，使用 {1}

# mcc.generator.generating
source: Generating {0} palette using the dataset: {1}
tr: Veri kümesini kullanarak {0} paleti oluşturuluyor: {1}
zh_hans: 正在从 {1} 生成 {0} 信息。
zh_hant: 正在從 {1} 生成 {0} 資訊。

# mcc.handshake
source: Handshake successful. (Server ID: {0})
ru: §8Handshake successful. (ID сервера: {0})
tr: §8Başarılı handshake. (Sunucu ID: {0})
zh_hans: §8握手成功。 (服务器ID：{0})
zh_hant: §8握手成功。 (伺服器ID：{0})

# mcc.has_update
source: A new version of MCC is available and you can download it via /upgrade Or download it manually: {0}
ru: §eNew version of MCC available: {0}
tr: §eMCCnin yeni sürümü mevcut: {0}
zh_hans: §e新版本的MCC已经推出：{0}
zh_hant: §e新版本的MCC已經推出：{0}

# mcc.help_us_translate
source: Help us translate MCC: {0}
tr: MCCyi çevirmemize yardımcı olun: {0}
zh_hans: 帮助我们翻译MCC：{0}
zh_hant: 幫助我們翻譯MCC：{0}

# mcc.invaild_config
source: Failed to parse the settings file, enter "{0}new" to generate a new configuration.
tr: Ayarlar dosyası ayrıştırılamadı, yeni bir yapılandırma oluşturmak için "{0}new" girin.
zh_hans: 解析配置文件失败，输入 "{0}new" 以生成一个新的配置。
zh_hant: 解析配置檔案失敗，輸入 "{0}new" 以生成一個新的配置。
