Repository: MCCTeam/Minecraft-Console-Client
Catalog: MinecraftClient/Resources/Translations/Translations.*.resx
Languages: ru, tr, zh_hans, zh_hant

# cache.loaded_keys
source: Loaded profile key, it will be refresh at {0}
ru: §8Loaded profile key, it will be refresh at {0}
tr: §8Profil anahtarı yüklendi, {0} saatinde yenilenecek
zh_hans: §8已加载签名密钥，下次刷新于 {0}
zh_hant: §8已載入簽名金鑰，下次重新整理於 {0}

# cache.loading
source: Loading Minecraft profiles: {0}
ru: §8Загрузка профилей Minecraft: {0}
tr: §8Minecraft profilleri yükleniyor: {0}
zh_hans: §8加载Minecraft配置文件：{0}
zh_hant: §8載入Minecraft配置檔案：{0}

# cache.loading_keys
source: Loading profile key cache from disk: {0}
ru: §8Loading profile key cache from disk: {0}
tr: §8Diskten profil anahtarı önbelleği yükleniyor: {0}
zh_hans: §8从磁盘加载聊天签名密钥缓存: {0}
zh_hant: §8從磁碟載入聊天簽名金鑰快取: {0}

# cache.loading_session
source: Loading session cache from disk: {0}
ru: §8Загрузка кэша сессий с диска: {0}
tr: §8Diskten oturum önbelleği yükleniyor: {0}
zh_hans: §8从磁盘加载会话缓存：{0}
zh_hant: §8從磁碟載入會話快取：{0}

# cache.malformed
source: Got malformed data while reading serialized session cache from disk: {0}
ru: §8Получены неверные данные при чтении сериализованного кэша сессии с диска: {0}
tr: §8Diskten serileştirilmiş oturum önbelleği okunurken hatalı biçimlendirilmiş veriler var: {0}
zh_hans: §8从磁盘读取序列化会话缓存时，获取到格式错误的数据：{0}
zh_hant: §8從磁碟讀取序列化會話快取時，獲取到格式錯誤的資料：{0}

# cache.read_fail
source: Failed to read serialized session cache from disk: {0}
ru: §8Failed to read serialized session cache from disk: {0}
tr: §8Diskten serileştirilmiş oturum önbelleği okunamadı: {0}
zh_hans: §8无法从磁盘读取序列化会话缓存：{0}
zh_hant: §8無法從磁碟讀取序列化會話快取：{0}

# cache.read_fail_plain
source: Failed to read session cache from disk: {0}
ru: §8Не удалось прочитать кэш сессии с диска: {0}
tr: §8Diskten oturum önbelleği okunamadı: {0}
zh_hans: §8无法从磁盘读取会话缓存：{0}
zh_hant: §8無法從磁碟讀取會話快取：{0}

# cache.read_fail_plain_keys
source: Failed to read profile key cache from disk: {0}
ru: §8Failed to read profile key cache from disk: {0}
tr: §8Diskten profil anahtarı önbelleği okunamadı: {0}
zh_hans: §8无法从磁盘读取聊天签名密钥缓存：{0}
zh_hant: §8無法從磁碟讀取聊天簽名金鑰快取：{0}

# cache.save_fail
source: Failed to write session cache to disk: {0}
ru: §8Не удалось записать кэш сессии на диск: {0}
tr: §8Oturum önbelleği diske yazılamadı: {0}
zh_hans: §8无法将会话缓存写入磁盘：{0}
zh_hant: §8無法將會話快取寫入磁碟：{0}

# cache.save_fail_keys
source: Failed to write profile key cache to disk: {0}
ru: §8Failed to write profile key cache to disk: {0}
tr: §8Profil anahtarı önbelleği diske yazılamadı: {0}
zh_hans: §8无法将聊天签名密钥写入磁盘：{0}
zh_hant: §8無法將聊天簽名金鑰寫入磁碟：{0}

# cache.saving
source: Saving session cache to disk
ru: §8Сохранение кэша сессии на диск
tr: §8Oturum önbelleğini diske kaydetme
zh_hans: §8将会话缓存保存到磁盘
zh_hant: §8將會話快取儲存到磁碟

# cache.saving_keys
source: Saving profile key cache to disk
ru: §8Saving profile key cache to disk
tr: §8Profil anahtarı önbelleğini diske kaydediliyor
zh_hans: §8将聊天签名密钥保存到磁盘
zh_hant: §8將聊天簽名金鑰儲存到磁碟

# chat.done
source: Done. File saved as '{0}'
ru: §8Сделано. Файл сохранен как '{0}'
tr: §8Tamamlandı. Dosya '{0}' olarak kaydedildi
zh_hans: §8下载完成。文件另存为 '{0}'
zh_hant: §8下載完成。檔案另存為 '{0}'

# chat.download
source: Downloading '{0}.json' from Mojang servers...
ru: §8Загрузка '{0}.lang' с серверов Mojang...
tr: §8Mojang sunucularından '{0}.lang' indiriliyor...
zh_hans: §8正在从Mojang服务器下载语言文件 '{0}.lang'...
zh_hant: §8正在從Mojang伺服器下載語言檔案 '{0}.lang'...

# chat.fail
source: Failed to download the file.
ru: §8Не удалось загрузить файл.
tr: §8Dosya indirilemedi.
zh_hans: §8下载文件失败。
zh_hant: §8下載檔案失敗。

# chat.loaded
source: Translations file loaded.
ru: §8Файл переводов загружен.
tr: §8Çeviri dosyası yüklendi.
zh_hans: §8已加载翻译文件。
zh_hant: §8已載入翻譯檔案。

# chat.message_chain_broken
source: Player {0}'s message chain is broken!
tr: {0} oyuncusunun mesaj zinciri koptu!
zh_hans: 玩家 {0} 的消息签名链已经被破坏。（签名不在可信）
zh_hant: 玩家 {0} 的訊息簽名鏈已經被破壞。（簽名不在可信）

# chat.not_found
source: Translations file not found: '{0}' Some messages won't be properly printed without this file.
ru: §8Файл переводов не найден: '{0}' Некоторые сообщения не будут правильно печататься без этого файла.
tr: §8Çeviri dosyası bulunamadı: '{0}' Bazı iletiler bu dosya olmadan düzgün yazdırılmayacaktır.
zh_hans: §8找不到翻译文件：'{0}' 如果没有此文件，某些信息将无法正确打印。
zh_hant: §8找不到翻譯檔案：'{0}' 如果沒有此檔案，某些資訊將無法正確列印。

# chat.request
source: Performing request to {0}
ru: §8Выполняем запрос к {0}
tr: §8{0} için istek gerçekleştiriliyor
zh_hans: §8正在请求{0}...
zh_hant: §8正在請求{0}...

# chatbot.reconnect
source: [{0}] Disconnecting and Reconnecting to the Server
ru: [{0}] Отключение и повторное подключение к серверу
tr: [{0}] Bağlantı kesildi ve tekrar bağlanılıyor.
zh_hans: [{0}] 断开并重新连接到服务器
zh_hant: [{0}] 斷開並重新連線到伺服器

# cmd.animation.desc
source: Swing your arm.
ru: Взмах руки.
tr: Kolunu salla.
zh_hans: 挥动你的手臂。
zh_hant: 揮動你的手臂。

# cmd.bed.bed_not_found
source: Could not find a bed!
tr: Yatak bulamadım!
zh_hans: 没有找到床！
zh_hant: 沒有找到床！

# cmd.bed.cant_reach_safely
source: Can not reach the bed safely!
tr: Yatağa güvenli bir şekilde ulaşılamıyor!
zh_hans: 无法安全地到达床边!
zh_hant: 無法安全地到達床邊!

# cmd.bed.desc
source: Used to sleep in or leave a bed.
tr: Bir yatakta uyumak veya yataktan ayrılmak için kullanılır.
zh_hans: 用于右键床开始睡觉或离开正在睡觉的床。
zh_hant: 用於右鍵床開始睡覺或離開正在睡覺的床。

# cmd.bed.failed_to_reach_in_time
source: Failed to reach the bed position (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) in time (30 seconds). Giving up!
tr: Yatak pozisyonuna (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) zamanında (30 saniyede) ulaşılamadı. Vazgeçmek!
zh_hans: 无法在30秒内到达(X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0})，放弃本次寻路。
zh_hant: 無法在30秒內到達(X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0})，放棄本次尋路。

# cmd.bed.found_a_bed_at
source: Found a bet at (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}).
tr: (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) noktasında bir yatak bulundu.
zh_hans: 在 (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) 找到了一个床。
zh_hant: 在 (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) 找到了一個床。

# cmd.bed.in
source: Succesfully laid in bed!
tr: Yatakta başarılı bir şekilde yattı!
zh_hans: 成功地躺在了床上！
zh_hant: 成功地躺在了床上！

# cmd.bed.leaving
source: Sending a command to leave a bed to the server.
tr: Sunucuya bir yatak bırakmak için bir komut gönderme.
zh_hans: 已向服务器发送离开床的数据包。
zh_hant: 已向伺服器傳送離開床的資料包。

# cmd.bed.moving
source: Moving to (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) where the bed is located.
tr: Yatağın bulunduğu yere (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) yürüyor.
zh_hans: 正在移动到床所在的位置： (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0})
zh_hant: 正在移動到床所在的位置： (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0})

# cmd.bed.not_a_bed
source: The block on (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) is not a bed!
tr: (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) üzerindeki blok bir yatak değildir!
zh_hans: 位于 (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) 的方块不是一个床！
zh_hant: 位於 (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) 的方塊不是一個床！

# cmd.bed.not_in
source: Could not lay in bed. Are you trying to sleep in a bed? (PS: You must use the head block coordinates of the bed)
tr: Yatakta uzanamadı. Bir yatakta uyumaya mı çalışıyorsun? (Not: Yatağın baş bloğu koordinatlarını kullanmalısınız)
zh_hans: 上床睡觉失败了。（PS: 你必须使用床头对应的坐标）
zh_hant: 上床睡覺失敗了。（PS: 你必須使用床頭對應的座標）

# cmd.bed.searching
source: Searching for a bed in radius of {0:0.00}...
ru: Searching for a bed in radius of {0}...
tr: {0} yarıçapında bir yatak aranıyor...
zh_hans: 在半径为{0}的范围内寻找床...
zh_hant: 在半徑為{0}的範圍內尋找床...

# cmd.bed.trying_to_use
source: Trying to sleep in a bed on location (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}). Result: {3}
tr: Konumdaki bir yatakta uyumaya çalışmak (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}). Sonuç: {3}
zh_hans: 试图在位于 (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) 上的床上睡觉，结果：{3}
zh_hant: 試圖在位於 (X: {0:0.0}, Y: {1:0.0}, Z: {2:0.0}) 上的床上睡覺，結果：{3}

# cmd.blockinfo.BlocksAround
source: Blocks around
tr: Etrafında bloklar
zh_hans: 附近的方块

# cmd.blockinfo.BlockType
source: Block type
tr: Blok türü
zh_hans: 方块类型

# cmd.blockinfo.desc
source: Reports the type of the block on the provided coordinates. (Use -s to report blocks around the target block).
tr: Sağlanan koordinatlarda bloğun türünü raporlar. (Hedef bloğun etrafındaki blokları bildirmek için -s kullanın).
zh_hans: 输出位于提供的坐标的方块类型。（使用 -s 来回报目标四周的方块）

# cmd.blockinfo.Negative
source: Negative
tr: Negatif
zh_hans: 负部分

# cmd.blockinfo.Positive
source: Positive
tr: Pozitif
zh_hans: 正部分

# cmd.bots.desc
source: List bots, unload a bot or all bots.
tr: Botları listeleyin, bir botu veya tüm botları kaldırın.
zh_hans: 列出全部 ChatBot ，加载或卸载一个 ChatBot。
zh_hant: 列出全部 ChatBot ，載入或解除安裝一個 ChatBot。

# cmd.bots.list
source: Loaded bots
tr: Yüklenen botlar
zh_hans: 已加载的 ChatBot
zh_hant: 已載入的 ChatBot

# cmd.bots.noloaded
source: No bots loaded!
tr: Hiçbir bot yüklenmedi!
zh_hans: 没有 ChatBot 被加载。
zh_hant: 沒有 ChatBot 被載入。

# cmd.bots.notfound
source: Bot {0} is not loaded, check if you have made a typo!
tr: Bot {0} yüklenmedi, yazım hatası yapıp yapmadığınızı kontrol edin!
zh_hans: 该 ChatBot 并未加载，请检查输入。
zh_hant: 該 ChatBot 並未載入，請檢查輸入。

# cmd.bots.unloaded
source: Successfully unloaded bot: {0}
ru: Успешно выгружен бот: {0}
tr: Bot başarıyla kaldırıldı: {0}
zh_hans: 成功卸载 ChatBot：{0}
zh_hant: 成功解除安裝 ChatBot：{0}

# cmd.bots.unloaded_all
source: Successfully unloaded all bots!
ru: Все боты успешно выгружены!
tr: Tüm botlar başarıyla kaldırıldı!
zh_hans: 成功卸载所有 ChatBot。
zh_hant: 成功解除安裝所有 ChatBot。

# cmd.changeSlot.changed
source: Changed to slot {0}
ru: Изменился на слот {0}
tr: Slot {0} olarak değiştirildi
zh_hans: 已变更为栏位{0}
zh_hant: 已變更為欄位{0}

# cmd.changeSlot.desc
source: Change slot in hotbar
ru: Изменить горячую панель
tr: Hotbar daki slotu değiştir
zh_hans: 变更快捷栏栏位
zh_hant: 變更快捷欄欄位

# cmd.changeSlot.fail
source: Could not change slot
ru: Не удалось изменить слот
tr: Slot değiştirilemedi
zh_hans: 无法变更栏位
zh_hant: 無法變更欄位

# cmd.changeSlot.nan
source: Could not change slot: Not a Number
ru: Не удалось изменить слот: Not a Number
tr: Slot değiştirilemedi: değer sayı değil
zh_hans: 无法变更栏位：不是数字
zh_hant: 無法變更欄位：不是數字

# cmd.chunk.chunk_pos
source: chunk: ({0}, {1}).
ru: чанк: {0}, {1}.
zh_hans: 区块：({0}, {1})。
zh_hant: 區塊：({0}, {1})。

# cmd.chunk.current
source: Current location：{0}, chunk: ({1}, {2}).
ru: Текущее местоположение：{0}, чанк: ({1}, {2}).
tr: Mevcut konum:{0}, chunk: ({1}, {2}).
zh_hans: 当前位置：{0}，所在区块：({1}, {2})。
zh_hant: 當前位置：{0}，所在區塊：({1}, {2})。

# cmd.chunk.desc
source: Displays the chunk loading status. Change EnableEmoji=false in the settings if the display is confusing.
ru: Отображает статус загрузки чанка. Изменение EnableEmoji=false в настройках, если дисплей запущен.
tr: Chunk yükleme durumunu görüntüler. Görüntü kafa karıştırıcıysa ayarlarda EnableEmoji=false öğesini değiştirin.
zh_hans: 显示区块加载状态。 如果显示错乱竟在设置中更改 EnableEmoji=false 。
zh_hant: 顯示區塊載入狀態。 如果顯示錯亂竟在設定中更改 EnableEmoji=false 。

# cmd.chunk.for_debug
source: This command is used for debugging, make sure you know what you are doing.
ru: §x§0Эта команда используется для отладки, убедитесь, что вы знаете, что делаете.§r
tr: §x§0Bu komut hata ayıklamak için kullanılır, ne yaptığınızı bildiğinizden emin olun.§r
zh_hans: §x§0此命令仅用于调试使用，确保你已经了解执行该命令会造成的影响。§r
zh_hant: §x§0此命令僅用於除錯使用，確保你已經瞭解執行該命令會造成的影響。§r

# cmd.chunk.icon
source: Player:{0}, MarkedChunk:{1}, NotReceived:{2}, Loading:{3}, Loaded:{4}
ru: Игрок:{0}, MarkedChunk:{1}, Не получило:{2}, Загрузка:{3}, Загружено:{4}
tr: Oyuncu:{0}, Aktif Chunk:{1}, Alınamayan:{2}, Yükleniyor:{3}, Yüklenmiş:{4}
zh_hans: 玩家:{0}，标记的区块:{1}，未收到:{2}，加载中:{3}，已加载:{4}
zh_hant: 玩家:{0}，標記的區塊:{1}，未收到:{2}，載入中:{3}，已載入:{4}

# cmd.chunk.marked
source: Marked location:
ru: Отметить местоположение:
tr: İşaretli konum:
zh_hans: 标记的位置：
zh_hant: 標記的位置：

# cmd.chunk.outside
source: Since the marked chunk is outside the graph, it will not be displayed!
ru: §x§0Поскольку отмеченный чанк находится вне графика, он не отображается!§r
tr: §x§0İşaretli parça grafiğin dışında olduğu için görüntülenmeyecektir!§r
zh_hans: §x§0由于被标记的区块距离玩家太远，它不会被显示在图中§r
zh_hant: §x§0由於被標記的區塊距離玩家太遠，它不會被顯示在圖中§r

# cmd.connect.desc
source: connect to the specified server.
ru: подключиться к указанному серверу.
tr: belirtilen sunucuya bağlanın.
zh_hans: 连接到指定的服务器。
zh_hant: 連線到指定的伺服器。

# cmd.connect.invalid_ip
source: Invalid server IP '{0}'.
ru: Неправильный IP-адрес сервера '{0}'.
tr: Geçersiz sunucu adresi '{0}'.
zh_hans: 无效的服务器IP '{0}'。
zh_hant: 無效的伺服器IP '{0}'。

# cmd.connect.unknown
source: Unknown account '{0}'.
ru: Неизвестная учетная запись '{0}'.
tr: Bilinmeyen hesap '{0}'.
zh_hans: 未知帐户 '{0}'。
zh_hant: 未知帳戶 '{0}'。

# cmd.debug.desc
source: toggle debug messages.
ru: переключить отладочные сообщения.
tr: hata ayıklama mesajları arasında geçiş yapın.
zh_hans: 切换调试消息。
zh_hant: 切換除錯訊息。

# cmd.debug.state_off
source: Debug messages are now OFF
ru: Отладочные сообщения теперь ВЫКЛ.
tr: Hata ayıklama mesajları artık KAPALI
zh_hans: 调试消息现在已关闭
zh_hant: 除錯訊息現在已關閉

# cmd.debug.state_on
source: Debug messages are now ON
ru: Отладочные сообщения теперь включены
tr: Hata ayıklama mesajları artık AÇIK
zh_hans: 调试消息现在已打开
zh_hant: 除錯訊息現在已開啟

# cmd.dig.desc
source: Attempt to break a block
ru: попытка разрушить блок
tr: Bir bloğu kırmaya çalışır
zh_hans: 试图破坏一个方块
zh_hant: 試圖破壞一個方塊

# cmd.dig.dig
source: Attempting to dig block at {0} {1} {2} ({3})
ru: Попытка пробить блок на {0} {1} {2}
tr: {0} {1} {2} ({3}) konumundaki blok kazılmaya başladı
zh_hans: 尝试挖掘位于({0}, {1}, {2})的方块({3})。
zh_hant: 嘗試挖掘位於({0}, {1}, {2})的方塊({3})。

# cmd.dig.fail
source: Failed to start digging block.
ru: Не удалось начать копать блок.
tr: Blok kazmaya başlanamadı.
zh_hans: 无法开始挖掘方块。
zh_hant: 無法開始挖掘方塊。

# cmd.dig.no_block
source: No block at this location (Air)
ru: Нет блока в этом месте (Air)
tr: Bu konumda blok yok (Hava)
zh_hans: 这个地方没有方块 (空气)
zh_hant: 這個地方沒有方塊 (空氣)

# cmd.dig.too_far
source: You are too far away from this block.
ru: Вы находитесь слишком далеко от этого блока.
tr: Bu bloktan çok uzaktasın.
zh_hans: 你离这个方块太远了。
zh_hant: 你離這個方塊太遠了。

# cmd.dropItem.desc
source: Drop specified type of items from player inventory or opened container
ru: Сбросить указанный тип предметов из инвентаря игрока или открытого контейнера
tr: Oyuncu envanterinden veya açılmış envanterden belirtilen türde öğeleri bırak
zh_hans: 丢弃玩家容器中的指定类型物品或打开的容器
zh_hant: 丟棄玩家容器中的指定型別物品或開啟的容器

# cmd.dropItem.dropped
source: Dropped all {0} from inventory #{1}
ru: Сбросил все {0} из инвентаря #{1}
tr: #{1} numaralı envanterden tüm {0} itemleri atıldı
zh_hans: 已从容器#{1}中丢弃所有{0}
zh_hant: 已從容器#{1}中丟棄所有{0}

# cmd.dropItem.unknown_item
source: Unknown item {0}
ru: Неизвестный предмет {0}
tr: Bilinmeyen öğe {0}
zh_hans: 未知物品：{0}
zh_hant: 未知物品：{0}

# cmd.enchant.clicked
source: Sent a click to the server, if you have enough levels and if you have placed the items in the correct slots it should enchant!
ru: Послал клик на сервер, если у вас достаточно уровней, и если вы разместили предметы в правильные ячейки, то он должен зачароваться!
tr: Yeterince seviyeniz varsa ve öğeleri doğru yuvalara yerleştirdiyseniz, sunucuya bir tıklama gönderdiniz!
zh_hans: 已发送按键给服务器。如果你有足够的经验值和已将物品摆放在正确的物品栏，物品应该会被附魔！

# cmd.enchant.desc
source: Enchant an item when you have the Enchantment table opened and the list of enchants recieved.
ru: Зачаровать предмет, когда вы открыли стол зачарования и список зачарований.
tr: Enchantment tablosunu açtığınızda ve büyülerin listesi alındığında bir öğeyi büyüleyin.
zh_hans: 使用已打开的附魔台来附魔物品。

# cmd.enchant.enchanting_no_item
source: You must put an item inside the enchanting table in slot 0!
ru: Вы должны поместить предмет в чарующий стол в ячейку 0!
tr: 0 numaralı slotta ki büyü masasının içine bir eşya koymalısın!
zh_hans: 你必须将物品放在附魔台的0号槽位中！

# cmd.enchant.enchanting_no_lapis
source: You must put at least 3 lapis lazuli inside the enchanting table in slot 1!
ru: Вы должны положить по крайней мере 3 лазурита внутри очаровательного стола в слот 1!
tr: Slot 1deki büyü masasının içine en az 3 lapis lazuli koymalısın!
zh_hans: 你必须在附魔台的1号槽位放置至少3个青金石！

# cmd.enchant.enchanting_table_not_opened
source: You must open a an enchanting table in order to use this option!
ru: Вы должны открыть чарующий стол, чтобы использовать этот вариант!
tr: Bu seçeneği kullanmak için büyü bir masası açmalısın!
zh_hans: 您必须先打开一个附魔台才能使用此功能！

# cmd.enchant.invalid_slot
source: Invalid slot provided (Available: top, middle, bottom)!
ru: Предоставлен недопустимый слот (Даёт: сверху, средний, внизу)!
tr: Geçersiz yuva sağlandı (Mevcut: top, middle, bottom)!
zh_hans: 提供了无效的槽位（可选：top，middle，bottom）

# cmd.enchant.no_enchantments
source: You must first put an item to enchant to the enchanting table in order to get enchantments from the server, then you can execute this command!
ru: Вы должны сначала поместить предмет, чтобы зачаровать его в чарующие столы, чтобы получить чары с сервера, тогда вы можете выполнить эту команду!
tr: Sunucudan büyü alabilmek için önce büyülenecek bir itemi büyü masasına koymalısınız, daha sonra bu komutu uygulayabilirsiniz!
zh_hans: 你必须先将物品放置在附魔台并从服务器获得附魔选项后才能使用这个指令！

# cmd.enchant.no_levels
source: You do not have enouhg levels to enchant! (Your current level is {0}, you need to be level {1}).
ru: У вас нет уровней заклинания для чаров! (Ваш текущий уровень - {0}, вам нужен {1} уровень).
tr: Büyüleyecek kadar seviyen yok! (Mevcut seviyeniz {0}, {1} seviyesinde olmanız gerekiyor).
zh_hans: 你的等级不足以进行附魔！（目前等级 {0}，附魔所需等级 {1}）

# cmd.enchant.not_clicked
source: Could not click!
ru: Не удалось нажать!
tr: Tıklanamadı!
zh_hans: 无法点击！

# cmd.entityCmd.attacked
source: Entity attacked
ru: Сущность атакована
tr: Entitye saldırma
zh_hans: 已攻击实体
zh_hant: 已攻擊實體

# cmd.entityCmd.boots
source: Boots
ru: Сапоги
tr: Bot
zh_hans: 靴子
zh_hant: 靴子

# cmd.entityCmd.chestplate
source: Chestplate
ru: Нагрудник
tr: Zırh
zh_hans: 胸甲
zh_hant: 胸甲

# cmd.entityCmd.customname
source: Custom Name
ru: Название пользователя
tr: Özel İsim
zh_hans: 自定义名称
zh_hant: 自定義名稱

# cmd.entityCmd.distance
source: Distance
ru: Дальность
tr: Mesafe
zh_hans: 距离
zh_hant: 距離

# cmd.entityCmd.entities
source: Entities
ru: События
tr: Entitiler
zh_hans: 实体集
zh_hant: 實體集

# cmd.entityCmd.entity
source: Entity
ru: существо
zh_hans: 实体
zh_hant: 實體

# cmd.entityCmd.equipment
source: Equipment
ru: Оборудование
tr: Teçhizat
zh_hans: 装备
zh_hant: 裝備

# cmd.entityCmd.health
source: Health
ru: Здоровье
tr: Can
zh_hans: 生命值
zh_hant: 生命值

# cmd.entityCmd.helmet
source: Helmet
ru: Шлем
tr: Kask
zh_hans: 头盔
zh_hant: 頭盔

# cmd.entityCmd.item
source: Item
ru: Предмет
tr: Öğe
zh_hans: 物品
zh_hant: 物品

# cmd.entityCmd.latency
source: Latency
ru: Задержка
tr: Gecikme
zh_hans: 延迟
zh_hant: 延遲

# cmd.entityCmd.leggings
source: Leggings
ru: Леггинсы
tr: Pantolon
zh_hans: 护腿
zh_hant: 護腿

# cmd.entityCmd.location
source: Location
ru: Местоположение
tr: Konum
zh_hans: 位置
zh_hant: 位置

# cmd.entityCmd.mainhand
source: Main Hand
ru: Главная рука
tr: Ana El
zh_hans: 主手
zh_hant: 主手

# cmd.entityCmd.nickname
source: Nickname
ru: Никнейм
zh_hans: 昵称
zh_hant: 暱稱

# cmd.entityCmd.not_found
source: Entity not found
ru: Собщество не найдено
tr: Entity bulunamadı
zh_hans: 找不到实体
zh_hant: 找不到實體

# cmd.entityCmd.offhand
source: Off Hand
tr: İkinci El
zh_hans: 副手
zh_hant: 副手

# cmd.entityCmd.pose
source: Pose
ru: Поза
tr: Poz
zh_hans: 姿势
zh_hant: 姿勢

# cmd.entityCmd.type
source: Type
ru: Тип
tr: Tür
zh_hans: 类型
zh_hant: 型別

# cmd.entityCmd.used
source: Entity used
ru: Существо использовано
tr: Entity kullanıldı
zh_hans: 已使用实体
zh_hant: 已使用實體

# cmd.execif.desc
source: Allows you to execute a command if a condition is met. (You can use variables from MinecraftClient.ini and /set command, as well as CSharp expressions)
ru: Позволяет выполнить команду, если условие выполнено. (Вы можете использовать переменные из команды MinecraftClient.ini и /set и CSharp)
tr: Bir koşul karşılandığında bir komutu yürütmenize izin verir. (MinecraftClient.ini ve /set komutundaki değişkenlerin yanı sıra CSharp ifadelerini kullanabilirsiniz.)
zh_hans: 允许你在某个条件成立时执行一个命令。(你可以使用"MinecraftClient.ini"中的变量和使用"/set"命令定义的变量，以及CSharp表达式）。
zh_hant: 允許你在某個條件成立時執行一個命令。(你可以使用"MinecraftClient.ini"中的變數和使用"/set"命令定義的變數，以及CSharp表示式）。

# cmd.execif.error
source: Error: {0}
ru: Ошибка: {0}
tr: Hata: {0}
zh_hans: 错误：{0}
zh_hant: 錯誤：{0}

# cmd.execif.error_occured
source: An error has occured while executing the command: {0}
ru: Произошла ошибка при выполнении команды: {0}
tr: Şu komut yürütülürken bir hata oluştu: {0}
zh_hans: 在执行命令 {0} 时出现错误。
zh_hant: 在執行命令 {0} 時出現錯誤。

# cmd.execif.executed
source: The condition '{0}' was met, executed command '{1}' with result '{2}'.
ru: Условие '{0}' выполнено, выполнена команда '{1}' с результатом '{2}'.
tr: '{0}' koşulu karşılandı, '{2}' sonucu ile '{1}' komutu yürütüldü.
zh_hans: 条件'{0}'满足，已执行命令'{1}'，得到结果'{2}'。
zh_hant: 條件'{0}'滿足，已執行命令'{1}'，得到結果'{2}'。

# cmd.execif.executed_no_output
source: The condition '{0}' was met, executed command '{1}', no result was returned.
ru: Условие '{0}' выполнено, выполнена команда '{1}', результат не был возвращен.
tr: '{0}' koşulu karşılandı, '{1}' komutu yürütüldü, sonuç döndürülmedi.
zh_hans: 条件'{0}'满足，已执行命令'{1}'，该命令没有返回任何结果。
zh_hant: 條件'{0}'滿足，已執行命令'{1}'，該命令沒有返回任何結果。

# cmd.execmulti.desc
source: Execute multiple commands one after another
ru: Выполнять несколько команд одна за другой
tr: Birden çok komutu birbiri ardına yürütün
zh_hans: 依次执行多个命令。
zh_hant: 依次執行多個命令。

# cmd.execmulti.executed
source: Executed the command '{0}' with {1}
ru: Выполнена команда '{0}' ' ' с {1}
tr: '{0}' komutunu {1} ile yürüttü
zh_hans: 执行了命令 '{0}' ，
zh_hant: 執行了命令 '{0}' ，

# cmd.execmulti.no_result
source: no result!
ru: нет результатов!
tr: sonuç yok!
zh_hans: 没有返回结果！
zh_hant: 沒有返回結果！

# cmd.execmulti.result
source: result '{0}'!
ru: результат '{0}'!
tr: sonuç '{0}'!
zh_hans: 结果为 '{0}'！
zh_hant: 結果為 '{0}'！

# cmd.exit.desc
source: disconnect from the server.
ru: отключиться от сервера.
tr: sunucuyla bağlantısını kesin.
zh_hans: 断开与服务器的连接。
zh_hant: 斷開與伺服器的連線。

# cmd.follow.already_following
source: Already following {0}!
ru: Уже преследую {0}!
tr: {0}i zaten takip ediyor!
zh_hans: 已经在跟随 {0} 了！
zh_hant: 已經在跟隨 {0} 了！

# cmd.follow.already_stopped
source: Already stopped
ru: Уже остановлено
tr: Zaten durdu
zh_hans: 已经停止过了
zh_hant: 已經停止過了

# cmd.follow.cant_reach_player
source: Can not reach the player, he is either in chunks that are not loaded, too far away or not reachable by a bot due to obstacles like gaps or water bodies!
ru: Не могу добраться до игрока, он либо в чанках, которые не загружены, Слишком далеко или недоступно ботом из-за таких препятствий, как разрывы или водяные органы!
tr: Oyuncuya ulaşamıyor, ya yüklü olmayan yığınlar içinde, çok uzakta ya da boşluklar veya su kütleleri gibi engellerden dolayı bir bot tarafından ulaşılamıyor!
zh_hans: 无法寻路到该玩家，有可能他在没有加载的区块中，或是距离太远，也有可能是间隙或水体等障碍使机器人无法到达。
zh_hant: 無法尋路到該玩家，有可能他在沒有載入的區塊中，或是距離太遠，也有可能是間隙或水體等障礙使機器人無法到達。

# cmd.follow.desc
source: Makes the bot follow a specified player
ru: Заставляет бота следить за указанным игроком
tr: Botun belirli bir oyuncuyu takip etmesini sağlar
zh_hans: 让机器人跟随指定的玩家
zh_hant: 讓機器人跟隨指定的玩家

# cmd.follow.invalid_name
source: Invalid or empty player name provided!
ru: Неверное или пустое имя игрока!
tr: Geçersiz veya boş oyuncu adı sağlandı!
zh_hans: 提供的玩家名无效！
zh_hant: 提供的玩家名無效！

# cmd.follow.invalid_player
source: The specified player is either not connected out out of the range!
ru: Указанный игрок либо не подключен за пределы диапазона!
tr: Belirtilen oynatıcı, kapsama alanı dışında bağlı değil!
zh_hans: 指定的玩家没有上线或距离太远！
zh_hant: 指定的玩家沒有上線或距離太遠！
