Repository: MCCTeam/Minecraft-Console-Client
Catalog: MinecraftClient/Resources/Translations/Translations.*.resx
Languages: ru, tr, zh_hans, zh_hant

# bot.alerts.end_rain
source: Weather change: It is no longer raining.
ru: §cИзменение погоды: Дождь больше не идет.§r
tr: §cHava değişikliği: Yağmur dindi.§r
zh_hans: §c天气变化：雨停了。§r
zh_hant: §c天氣變化：雨停了。§r

# bot.alerts.end_thunderstorm
source: Weather change: It is no longer a thunderstorm.
ru: §cИзменение погоды: Гроза больше не идет.§r
tr: §cHava değişikliği: Fırtına bitti.§r
zh_hans: §c天气变化：现在不再是雷雨天了。§r
zh_hant: §c天氣變化：現在不再是雷雨天了。§r

# bot.alerts.start_rain
source: Weather change: It is raining now.
ru: §cИзменения погоды: Начался дождь.§r
tr: §cHava değişikliği: Yağmur yağıyor.§r
zh_hans: §c天气变化：开始下雨了。§r
zh_hant: §c天氣變化：開始下雨了。§r

# bot.alerts.start_thunderstorm
source: Weather change: It is a thunderstorm.
ru: §cИзменения погоды: Началась гроза.§r
tr: §cHava değişikliği: Fırtınalı başlandı.§r
zh_hans: §c天气变化：现在是雷雨天。§r
zh_hant: §c天氣變化：現在是雷雨天。§r

# bot.antiafk.invalid_walk_range
source: Invalid walk range provided, must be a positive integer greater than 0, using default value of 5!
ru: Указанный недопустимый диапазон обхода должен быть положительным целым числом, большим 0, используя значение по умолчанию 5!
tr: Geçersiz yürüyüş mesafesi, varsayılan 5 değeri kullanın veya 0dan büyük bir sayı belirleyin!
zh_hans: 当前提供的行走范围无效，它必须是一个大于0的正整数，将使用默认值5!
zh_hant: 當前提供的行走範圍無效，它必須是一個大於0的正整數，將使用預設值5!

# bot.antiafk.not_using_terrain_handling
source: The terrain handling is not enabled in the settings of the client, enable it if you want to use it with this bot. Using alternative (command) method.
ru: Обработка рельефа местности не включена в настройках клиента, включите ее, если вы хотите использовать ее с этим ботом. Используя альтернативный (командный) метод.
tr: İstemci ayarlarında terrain and movement etkin değil, bu botla kullanmak istiyorsanız etkinleştirin. Alternatif (komut) yöntemini kullanma.
zh_hans: 当前未启用地形处理，如果你想使用相关的特性，请在设置中启用它。当前将继续使用替代方法运行（定时发送命令）。
zh_hant: 當前未啟用地形處理，如果你想使用相關的特性，請在設定中啟用它。當前將繼續使用替代方法執行（定時傳送命令）。

# bot.antiafk.swapping
source: The time range begins with a bigger value, swapped them around.
ru: Временной диапазон начинается с большего значения, поменяй их местами.
tr: Zaman aralığı daha büyük bir değerle başlar, onları değiştirin.
zh_hans: 最短时间大于最长时间，已将它们交换。
zh_hant: 最短時間大於最長時間，已將它們交換。

# bot.autoAttack.invalidcooldown
source: Attack cooldown value cannot be smaller than 0.
ru: Значение кулдауна атаки не может быть меньше 0. По умолчанию используется auto.
tr: Saldırı bekleme süresi değeri 0dan küçük olamaz.
zh_hans: 攻击冷却时间值不能小于0，已使用自动作为默认值
zh_hant: 攻擊冷卻時間值不能小於0，已使用自動作為預設值

# bot.autoCraft.aborted
source: Crafting aborted! Check your available materials.
ru: Разработка прервана! Проверьте доступные материалы.
tr: Üretim iptal edildi! Mevcut malzemelerinizi kontrol edin.
zh_hans: 制作被终止！请检查可用材料。
zh_hant: 製作被終止！請檢查可用材料。

# bot.autoCraft.alias
source: Auto-crafting ChatBot command alias
ru: Псевдоним команды ChatBot для автоматического крафтинга
zh_hans: 自动制作ChatBot命令的别名
zh_hant: 自動製作ChatBot命令的別名

# bot.autoCraft.available_cmd
source: Available commands: {0}. Use /autocraft help <cmd name> for more information.
ru: Доступные команды: {0}. Для получения дополнительной информации используйте /autocraft help <имя команды>. Вы можете использовать /ac в качестве псевдонима команды.
tr: Kullanılabilir komutlar: {0}. Daha fazla bilgi için /autocraft help <cmd name> kullanın. Komut takma adı olarak /ac as kullanabilirsiniz.
zh_hans: 可用命令：{0}。可使用 /autocraft help <命令名> 了解更多信息。您可以使用 /ac 作为命令别名。
zh_hant: 可用命令：{0}。可使用 /autocraft help <命令名> 瞭解更多資訊。您可以使用 /ac 作為命令別名。

# bot.autoCraft.close_inventory
source: Inventory #{0} was closed by AutoCraft
ru: Инвентарь #{0} был закрыт автокрафтом
tr: Envanter #{0} AutoCraft tarafından kapatıldı
zh_hans: 容器#{0}被AutoCraft关闭
zh_hant: 容器#{0}被AutoCraft關閉

# bot.autoCraft.cmd
source: Auto-crafting ChatBot command
ru: Команда автоматического крафтинга ЧатБота
zh_hans: 自动制作ChatBot命令
zh_hant: 自動製作ChatBot命令

# bot.autoCraft.cmd.list
source: Total {0} recipes loaded: {1}
ru: Всего загружено {0} рецептов: {1}
tr: Yüklenen toplam {0} tarif: {1}
zh_hans: 已加载{0}个配方：{1}
zh_hant: 已載入{0}個配方：{1}

# bot.autoCraft.craft_fail
source: Crafting failed! Waiting for more materials
ru: Разработка не удалась! Ожидание новых материалов
tr: Üretim başarısız oldu! Daha fazla malzeme bekliyorum
zh_hans: 制作失败！等待更多材料
zh_hant: 製作失敗！等待更多材料

# bot.autoCraft.exception.duplicate
source: Duplicate recipe name specified: {0}
ru: Дублируется указанное имя рецепта: {0}
tr: Belirtilen yinelenen tarif adı: {0}
zh_hans: 指定了重复的配方名称：{0}
zh_hant: 指定了重複的配方名稱：{0}

# bot.autoCraft.exception.name_miss
source: Missing recipe name while parsing a recipe
ru: Пропущено имя рецепта при разборе рецепта
tr: Tarif ayrıştırılırken tarif adı eksik
zh_hans: 解析配方时缺少配方名称
zh_hant: 解析配方時缺少配方名稱

# bot.autoCraft.help.help
source: Get the command description. Usage: /autocraft help <command name>
ru: Получить описание команды. Использование: /autocraft help <имя команды>.
tr: Komut açıklamasını alın. Kullanım: /autocraft help <command name>
zh_hans: 获取命令描述。用法：/autocraft help <命令名>
zh_hant: 獲取命令描述。用法： /autocraft help <命令名>

# bot.autoCraft.help.list
source: List available recipes.
ru: Список названий загруженных рецептов.
tr: Mevcut tarifleri listeleyin.
zh_hans: 列出可用配方。
zh_hant: 列出可用配方。

# bot.autoCraft.help.load
source: Load the config file.
ru: Загрузить файл конфигурации.
tr: Ayar dosyasını yükleyin.
zh_hans: 加载配置文件。
zh_hant: 載入配置檔案。

# bot.autoCraft.help.reload
source: Reload the config file.
ru: Загрузить файл конфигурации.
tr: Ayar dosyasını yeniden yükleyin.
zh_hans: 重新加载配置文件。
zh_hant: 重新載入配置檔案。

# bot.autoCraft.help.resetcfg
source: Write the default example config to default location.
ru: Записать конфигурацию примера по умолчанию в стандартное место.
tr: Varsayılan örnek yapılandırmayı varsayılan konuma yazın.
zh_hans: 将默认示例配置写入默认位置。
zh_hant: 將預設示例配置寫入預設位置。

# bot.autoCraft.help.start
source: Start the crafting. Usage: /autocraft start <recipe name>
ru: Запустить крафтинг. Использование: /autocraft start <имя рецепта>.
tr: İşçiliği başlatın. Kullanım: /autocraft start <recipe name>
zh_hans: 开始制作。用法：/autocraft start <配方名称>
zh_hant: 開始製作。用法：/autocraft start <配方名稱>

# bot.autoCraft.help.stop
source: Stop the current running crafting process
ru: Остановить текущий запущенный процесс крафтинга
tr: Mevcut üretimi durdurun
zh_hans: 停止当前正在进行的制作过程
zh_hant: 停止當前正在進行的製作過程

# bot.autocraft.invaild_result
source: Invalid result item!
ru: Некорректный результат предмета!.
tr: Geçersiz sonuç öğesi!
zh_hans: 无效的输出物品！
zh_hant: 無效的輸出物品！

# bot.autocraft.invaild_slots
source: The number of slots does not match and has been adjusted automatically.
ru: Количество слотов не совпадает и было скорректировано автоматически.
tr: Slot sayısı eşleşmiyor ve otomatik olarak ayarlandı.
zh_hans: 配方的物品数量不匹配，已自动调整。
zh_hant: 配方的物品數量不匹配，已自動調整。

# bot.autoCraft.missing_material
source: Missing material: {0}
ru: Недостающий материал: {0}
tr: Eksik eşya: {0}
zh_hans: 缺失材料：{0}
zh_hant: 缺失材料：{0}

# bot.autoCraft.no_recipe_name
source: Please specify the recipe name you want to craft.
ru: Пожалуйста, укажите название рецепта, который вы хотите создать.
tr: Lütfen oluşturmak istediğiniz tarifin adını belirtin.
zh_hans: 请指定要制作的配方名称。
zh_hant: 請指定要製作的配方名稱。

# bot.autoCraft.recipe_not_exist
source: Specified recipe name does not exist. Check your config file.
ru: Указанное имя рецепта не существует. Проверьте свой конфигурационный файл.
tr: Belirtilen tarif adı mevcut değil. Ayar dosyanızı kontrol edin.
zh_hans: 指定的配方名称不存在。请检查配置文件。
zh_hant: 指定的配方名稱不存在。請檢查配置檔案。

# bot.autoCraft.start
source: Starting AutoCraft: {0}
ru: Запуск автокрафта: {0}
tr: AutoCraft başlatılıyor: {0}
zh_hans: AutoCraft启动中：{0}
zh_hant: AutoCraft啟動中：{0}

# bot.autoCraft.start_fail
source: AutoCraft cannot be started. Check your available materials for crafting {0}
ru: Автокрафт не может быть запущен. Проверьте доступные материалы для крафтинга {0}
tr: AutoCraft başlatılamıyor. {0} işçiliği için mevcut malzemelerinizi kontrol edin
zh_hans: 无法启动AutoCraft。请检查用于制作{0}的可用材料
zh_hant: 無法啟動AutoCraft。請檢查用於製作{0}的可用材料

# bot.autoCraft.stop
source: AutoCraft stopped
ru: Автокрафт остановлен
tr: AutoCraft durdu
zh_hans: AutoCraft已停止
zh_hant: AutoCraft已停止

# bot.autoCraft.table_not_found
source: table not found
ru: Таблица не найдена
tr: çalışma masası bulunamadı
zh_hans: 找不到工作台
zh_hant: 找不到工作臺

# bot.autoCraft.timeout
source: Action timeout! Reason: {0}
ru: Время выполнения действия истекло! Причина: {0}
tr: İşlem zaman aşımı! Neden: {0}
zh_hans: 动作超时！原因：{0}
zh_hant: 動作超時！原因：{0}

# bot.autodig.available_cmd
source: Available commands: {0}. Use /autodig help <cmd name> for more information.
ru: Доступные команды: {0}. Используйте /digbot help <cmd name> для получения дополнительной информации.
tr: Kullanılabilir komutlar: {0}. Daha fazla bilgi için /digbot help <cmd name> kullanın.
zh_hans: 可用命令：{0}。可使用 /digbot help <命令名> 了解更多信息。
zh_hant: 可用命令：{0}。可使用 /digbot help <命令名> 瞭解更多資訊。

# bot.autodig.cmd
source: Auto-digging ChatBot command
ru: Чатбот авто-копание команды
zh_hans: 自动挖掘 ChatBot 命令
zh_hant: 自動挖掘 ChatBot 命令

# bot.autodig.dig_timeout
source: Digging block timeout, retry.
ru: Тайм-аут блока копания, повторите попытку.
tr: Kazma bloğu zaman aşımı, yeniden deneyin.
zh_hans: 挖掘方块超时，重试。
zh_hant: 挖掘方塊超時，重試。

# bot.autodig.help.help
source: Get the command description. Usage: /autodig help <command name>
ru: Получить описание команды. Использование: /autocraft help <имя команды>.
tr: Komut açıklamasını alın. Kullanım: /digbot help <command name>
zh_hans: 获取命令描述。用法：/digbot help <命令名>
zh_hant: 獲取命令描述。用法：/digbot help <命令名>

# bot.autodig.help.start
source: Start the automatic digging bot.
ru: Запустить автоматического копаниющего бота.
tr: Otomatik kazma botunu başlatın.
zh_hans: 开始运行自动挖掘。
zh_hant: 開始執行自動挖掘。

# bot.autodig.help.stop
source: Deactivate the automatic digging bot.
ru: Отключить автоматического копающего бота.
tr: Otomatik kazma botunu devre dışı bırakın.
zh_hans: 停止运行自动挖掘。
zh_hant: 停止執行自動挖掘。

# bot.autodig.not_allow
source: The block currently pointed to is not in the allowed list.
ru: Блок не находится в разрешенном списке.
tr: Şu anda işaret edilen blok izin verilenler listesinde değil.
zh_hans: 当前所看向的方块不在允许挖掘列表中。
zh_hant: 當前所看向的方塊不在允許挖掘列表中。

# bot.autodig.start
source: Automatic digging has started.
ru: Автоматическое копание началось.
tr: Otomatik kazma başladı.
zh_hans: 开始自动挖掘。
zh_hant: 開始自動挖掘。

# bot.autodig.start_delay
source: Digging will start in {0:0.0} second(s).
ru: Копание начнется через {0:0.0} секунд(ы).
tr: Kazma {0:0.0} saniye içinde başlayacak.
zh_hans: 将在 {0:0.0} 秒后开始自动挖掘。
zh_hant: 將在 {0:0.0} 秒後開始自動挖掘。

# bot.autodig.stop
source: Auto-digging has been stopped.
ru: Автоматическое копание остановлено.
tr: Otomatik kazma durduruldu.
zh_hans: 停止自动挖掘。
zh_hant: 停止自動挖掘。

# bot.autoDrop.added
source: Added item {0}
ru: Добавлен элемент {0}
tr: {0} öğesi eklendi
zh_hans: 已添加物品{0}
zh_hant: 已新增物品{0}

# bot.autoDrop.alias
source: AutoDrop ChatBot command alias
ru: Псевдоним команды автоудаления ЧатБота
zh_hans: 自动丢弃 ChatBot 命令别名
zh_hant: 自動丟棄 ChatBot 命令別名

# bot.autoDrop.cmd
source: AutoDrop ChatBot command
ru: Команда автоудаления ЧатБота
tr: AutoDrop ChatBot komudu
zh_hans: 自动丢弃 ChatBot 命令
zh_hant: 自動丟棄 ChatBot 命令

# bot.autoDrop.incorrect_name
source: Incorrect item name {0}. Please try again.
ru: Неправильное название элемента {0}. Пожалуйста, попробуйте еще раз
tr: Yanlış öğe adı {0}. Lütfen tekrar deneyin.
zh_hans: 物品名称不正确：{0}。请再试一次。
zh_hant: 物品名稱不正確：{0}。請再試一次。

# bot.autoDrop.list
source: Total {0} in the list: {1}
ru: Всего {0} в списке: {1}
tr: Total {0} listede: {1}
zh_hans: 列表中总计{0}个物品： {1}
zh_hant: 列表中總計{0}個物品： {1}

# bot.autoDrop.no_inventory
source: Cannot find inventory {0}!
ru: Не удается найти инвентарь {0}!
tr: Envanter {0} bulunamıyor!
zh_hans: 找不到容器{0}!
zh_hant: 找不到容器{0}!

# bot.autoDrop.no_item
source: No item in the list
ru: Нет элемента в списке
tr: Listede öğe yok
zh_hans: 列表中没有物品
zh_hant: 列表中沒有物品

# bot.autoDrop.no_mode
source: Cannot read drop mode from config. Using include mode.
ru: Невозможно прочитать режим падения из конфигурации. Используется режим включения.
tr: Drop modu okunamıyor. include modunu kullanın.
zh_hans: 无法从配置中读取丢弃模式（drop mode）。使用Include模式。
zh_hant: 無法從配置中讀取丟棄模式（drop mode）。使用Include模式。

# bot.autoDrop.not_in_list
source: Item not in the list
ru: Элемент отсутствует в списке
tr: Listede olmayan öğe
zh_hans: 物品不在列表中
zh_hant: 物品不在列表中

# bot.autoDrop.off
source: AutoDrop disabled
ru: Автоудаление отключено
tr: AutoDrop devre dışı
zh_hans: 已禁用自动丢弃
zh_hant: 已禁用自動丟棄

# bot.autoDrop.on
source: AutoDrop enabled
ru: Автоудаление включено
tr: AutoDrop etkinleştirildi
zh_hans: 已启用自动丢弃
zh_hant: 已啟用自動丟棄

# bot.autoDrop.removed
source: Removed item {0}
ru: Удаленный элемент {0}
tr: {0} öğesi kaldırıldı
zh_hans: 已删除物品{0}
zh_hant: 已刪除物品{0}

# bot.autoDrop.switched
source: Switched to {0} mode.
ru: Переключено в режим {0}.
tr: {0} moduna geçildi.
zh_hans: 切换到{0}模式。
zh_hant: 切換到{0}模式。

# bot.autoDrop.unknown_mode
source: Unknwon mode. Available modes: Include, Exclude, Everything
ru: Неизвестный режим. Доступные режимы: Включить, Исключить, Все
tr: Bilinmeyen mod. Mevcut modlar: Include, Exclude, Everything
zh_hans: 未知模式。可用的模式：Include, Exclude, Everything
zh_hant: 未知模式。可用的模式：Include, Exclude, Everything

# bot.autoFish.available_cmd
source: Available commands: {0}. Use /fish help <cmd name> for more information.
ru: Доступные команды: {0}. Используйте /fish help <cmd name> для получения дополнительной информации.
tr: Kullanılabilir komutlar: {0}. Daha fazla bilgi için /fish help <cmd name> kullanın.
zh_hans: 可用命令：{0}。可使用 /fish help <命令名> 了解更多信息。
zh_hant: 可用命令：{0}。可使用 /fish help <命令名> 瞭解更多資訊。

# bot.autoFish.cast_timeout
source: Casting timeout and will soon retry. (Timeout increased to {0:0.0} sec).
ru: Тайм-аут раздачи и скоро повторится. (Тайм-аут увеличился до {0:0.0} сек).
tr: Yayın zaman aşımına uğradı ve yakında yeniden denenecek. (Zaman aşımı {0:0.0} saniyeye yükseltildi).
zh_hans: 抛竿超时，将在等待一段时间后重试。（超时时间延长至 {0:0.0} 秒）
zh_hant: 拋竿超時，將在等待一段時間後重試。（超時時間延長至 {0:0.0} 秒）

# bot.autoFish.caught
source: Retract the fishing rod. (Count: {0})
ru: Поймал рыбу!
tr: Oltayı geri çekin. (Sayı: {0})
zh_hans: 收竿!（总计第 {0} 次）
zh_hant: 收竿!（總計第 {0} 次）

# bot.autoFish.caught_at
source: Retract the fishing rod at ({0:0.0},{1:0.0},{2:0.0})! (Count: {3})
ru: Снять удочку с рыбалки ({0:0.0},{1:0.0},{2:0.0})! (Количество - {3})
tr: Oltayı ({0:0.0},{1:0.0},{2:0.0})da geri çekin! (Sayı: {3})
zh_hans: 收竿 (位于 {0:0.0},{1:0.0},{2:0.0}) ！（总计第 {3} 次）
zh_hant: 收竿 (位於 {0:0.0},{1:0.0},{2:0.0}) ！（總計第 {3} 次）

# bot.autoFish.cmd
source: Auto-Fishing ChatBot command
ru: Команды авторыбалки ChatBot
zh_hans: 自动钓鱼 ChatBot 命令
zh_hant: 自動釣魚 ChatBot 命令

# bot.autoFish.despawn
source: Fish floating despawn, will re-cast.
ru: Поплавок пропал, пробуем заново.
tr: Umutsuzluğa kapılan balık yüzer, yeniden atılır.
zh_hans: 鱼钩消失，将会重新抛竿。
zh_hant: 魚鉤消失，將會重新拋竿。

# bot.autoFish.fishing_timeout
source: Fishing timeout, will soon re-cast.
ru: Тайм-аут рыбалки, скоро начнется повторно.
tr: Balık tutma zaman aşımı, yakında yeniden yayınlanacak.
zh_hans: 钓鱼超时，将于几秒钟后重新抛竿。
zh_hant: 釣魚超時，將於幾秒鐘後重新拋竿。

# bot.autoFish.got
source: Fishing got {0}
ru: Рыбалка получила {0}
tr: {0} Balık aldı
zh_hans: 钓到了 {0}
zh_hant: 釣到了 {0}

# bot.autoFish.help.help
source: Get the command description. Usage: /fish help <command name>
ru: Получить описание команды. Использование: /fish help <command name>
tr: Komut açıklamasını alın. Kullanım: /fish help <command name>
zh_hans: 获取命令描述。用法：/fish help <命令名>
zh_hant: 獲取命令描述。用法：/fish help <命令名>

# bot.autoFish.help.start
source: Start auto-fishing.
ru: Начать автоматическую рыбалку.
tr: auto-fishing başlatır.
zh_hans: 开始自动钓鱼。
zh_hant: 開始自動釣魚。

# bot.autoFish.help.status
source: List all obtained items. Or use "/fish status clear" to clear the list.
ru: Список всех полученных элементов. Или используйте "/fish status clear" чтобы очистить список.
tr: Elde edilen tüm öğeleri listeleyin. Veya listeyi temizlemek için "/fish status clear" komudunu kullanın.
zh_hans: 列出钓到的物品。或者使用 "/fish status clear" 清空该列表。
zh_hant: 列出釣到的物品。或者使用 "/fish status clear" 清空該列表。

# bot.autoFish.help.stop
source: Stop auto-fishing.
ru: Остановить автоматическую рыбалку.
tr: auto-fishing durdurur.
zh_hans: 停止自动钓鱼。
zh_hant: 停止自動釣魚。

# bot.autoFish.no_inv_handle
source: Inventory handling is not enabled. Cannot check rod durability and switch rods.
ru: Обработка инвентаря не включена. Не удается проверить прочность удочки и переключить удочку.
tr: Inventory Handling etkin değil. Olta dayanıklılığı kontrol edilemiyor ve oltalar değiştirilemiyor.
zh_hans: 未启用库存(物品)处理。将不支持检查鱼竿耐久度都和自动切换鱼竿。
zh_hant: 未啟用庫存(物品)處理。將不支援檢查魚竿耐久度都和自動切換魚竿。

# bot.autoFish.no_rod
source: Current fishing rod is not available. Maybe broken or low durability?
ru: Нет удочки под рукой. Может быть сломана?
tr: Mevcut olta mevcut değil. Belki kırık veya düşük dayanıklılık?
zh_hans: 没有可使用的钓鱼竿了。也许是用坏了或耐久度过低？
zh_hant: 沒有可使用的釣魚竿了。也許是用壞了或耐久度過低？

# bot.autoFish.start
source: Start auto-fishing.
ru: Начать автоматическую рыбалку.
tr: auto-fishing başlat.
zh_hans: 开始自动钓鱼。
zh_hant: 開始自動釣魚。

# bot.autoFish.start_at
source: Fishing will start in {0:0.0} second(s).
ru: Рыбалка начнется через {0:0.0} секунд(ы).
tr: Balık tutmaya {0:0.0} saniye içinde başlayacak.
zh_hans: 将在 {0:0.0} 秒后自动开始钓鱼。
zh_hant: 將在 {0:0.0} 秒後自動開始釣魚。

# bot.autoFish.status_clear
source: The record of the obtained items has been cleared.
ru: Запись о полученных элементах была очищена.
tr: Elde edilen eşyaların kaydı temizlendi.
zh_hans: 已清空钓到的物品信息。
zh_hant: 已清空釣到的物品資訊。

# bot.autoFish.status_info
source: All items obtained from fishing (not entirely accurate):
ru: Все предметы, полученные от рыбалки (не совсем точно):
tr: Balıkçılıktan elde edilen tüm eşyalar (tamamen doğru değil):
zh_hans: 所有钓到的物品（不完全准确）：
zh_hant: 所有釣到的物品（不完全準確）：

# bot.autoFish.stop
source: Stop auto-fishing.
ru: Остановить автоматическую рыбалку.
tr: auto-fishing durdurur.
zh_hans: 停止自动钓鱼。
zh_hant: 停止自動釣魚。

# bot.autoFish.switch
source: Switch to the rod in slot {0}, durability {1}/64.
ru: Переключиться на удочку в ячейке {0}, прочность {1}/64.
tr: {0} slotunda ki oltaya geçin, dayanıklılık {1}/64.
zh_hans: 切换到位于背包 {0} 位置的鱼竿，剩余耐用 {1}/64。
zh_hant: 切換到位於揹包 {0} 位置的魚竿，剩餘耐用 {1}/64。

# bot.autoFish.throw
source: Casting successfully.
ru: Закинул удочку
tr: Başarılı bir şekilde döküm.
zh_hans: 抛竿成功。
zh_hant: 拋竿成功。

# bot.autoFish.update_lookat
source: Update yaw = {0:0.00}, pitch = {1:0.00}.
ru: Обновить yaw = {0:0.00}, высота = {1:0.00}.
tr: Güncelleme yaw = {0:0.00}, pitch = {1:0.00}.
zh_hans: 更新当前朝向 偏航角(yaw) = {0:0.00}, 俯仰角(pitch) = {1:0.00}。
zh_hant: 更新當前朝向 偏航角(yaw) = {0:0.00}, 俯仰角(pitch) = {1:0.00}。

# bot.autoRelog.curr_dir
source: Current directory was: {0}
ru: Текущий каталог был: {0}
tr: Geçerli dizin şuydu: {0}
zh_hans: 当前目录为：{0}
zh_hant: 當前目錄為：{0}

# bot.autoRelog.disconnect_msg
source: Got disconnected with message: {0}
ru: Произошло отключение с сообщением: {0}
tr: Şu mesajla bağlantı kesildi: {0}
zh_hans: 连接断开，收到消息：{0}
zh_hant: 連線斷開，收到訊息：{0}

# bot.autoRelog.ignore_user_logout
source: Disconnection initiated by User or MCC bot. Ignoring.
ru: Отключение инициировано пользователем или MCC-ботом. Игнорирование.
tr: Kullanıcı veya MCC botu tarafından başlatılan bağlantı kesilmesi. Yoksayıldı.
zh_hans: 由用户或MCC bot启动的断开连接。忽略。
zh_hant: 由使用者或MCC bot啟動的斷開連線。忽略。

# bot.autoRelog.launch
source: Launching with {0} reconnection attempts
ru: Запуск с {0} попытками повторного подключения
tr: {0} yeniden bağlanma girişimiyle başlatılıyor
zh_hans: 已启动，尝试了{0}次重新连接
zh_hant: 已啟動，嘗試了{0}次重新連線

# bot.autoRelog.no_kick_msg
source: Initializing without a kick message file
ru: Инициализация без файла сообщения о кике
tr: Kick mesaj dosyası olmadan başlatılıyor
zh_hans: 在没有kick消息文件的情况下初始化
zh_hant: 在沒有kick訊息檔案的情況下初始化

# bot.autoRelog.reconnect
source: Message contains '{0}'. Reconnecting.
ru: Сообщение содержит '{0}'. Переподключаемся.
tr: Mesaj '{0}' içeriyor. Yeniden bağlanılıyor.
zh_hans: 信息包含 '{0}'。重新连接。
zh_hant: 資訊包含 '{0}'。重新連線。

# bot.autoRelog.reconnect_always
source: Ignoring kick message, reconnecting anyway.
ru: Игнорирует сообщение о пинке, все равно переподключается.
tr: Kick mesajını görmezden geliyor, yine de yeniden bağlanıyor.
zh_hans: 忽略kick消息，仍要重新连接。
zh_hant: 忽略kick訊息，仍要重新連線。

# bot.autoRelog.reconnect_ignore
source: Message not containing any defined keywords. Ignoring.
ru: Сообщение не содержит определенных ключевых слов. Игнорирование.
tr: Tanımlanmış herhangi bir anahtar kelime içermeyen mesaj. Yoksaymak.
zh_hans: 不包含任何已定义关键字的消息，忽略。
zh_hant: 不包含任何已定義關鍵字的訊息，忽略。

# bot.autoRelog.wait
source: Waiting {0:0.000} seconds before reconnecting...
ru: Ожидание {0:0.000} секунд перед переподключением...
tr: Yeniden bağlanmadan önce {0} saniye bekleniyor...
zh_hans: 等待{0:0.000}秒后重新连接...
zh_hant: 等待{0:0.000}秒後重新連線...

# bot.autoRespond.file_not_found
source: File not found: '{0}'
ru: Файл не найден: '{0}'
tr: Dosya bulunamadı: '{0}'
zh_hans: 找不到文件或目录： '{0}'
zh_hant: 找不到檔案或目錄： '{0}'

# bot.autoRespond.loaded_match
source: Loaded match: {0}
ru: Загружено совпадение: {0}
tr: Yüklenen eşleşme: {0}
zh_hans: 加载匹配项： {0}
zh_hant: 載入匹配項： {0}

# bot.autoRespond.loading
source: Loading matches from '{0}'
ru: Загрузка совпадений из '{0}'
tr: '{0}' kaynağından eşleşmeler yükleniyor
zh_hans: 正在从'{0}'加载匹配项
zh_hant: 正在從'{0}'載入匹配項

# bot.autoRespond.match
source: match: {0} regex: {1} action: {2} actionPrivate: {3} actionOther: {4} ownersOnly: {5} cooldown: {6}
ru: соответствие: {0} regex: {1} action: {2} actionPrivate: {3} actionOther: {4} nownersOnly: {5} cooldown: {6}
zh_hans: 匹配： {0} 正则： {1} 动作： {2} 私聊消息动作： {3} 其他消息动作： {4} 仅响应所有者： {5} 冷却时间： {6}

# bot.autoRespond.match_run
source: Running action: {0}
ru: Действие запущено: {0}
tr: Çalıştırılan işlem: {0}
zh_hans: 进行操作：{0}
zh_hant: 進行操作：{0}

# bot.autoRespond.no_action
source: No action for match: {0}
ru: Нет действия для матча: {0}
tr: Eşleşme için işlem yok: {0}
zh_hans: 匹配没有对应操作: {0}
zh_hant: 匹配沒有對應操作: {0}

# bot.autoRespond.no_trigger
source: This match will never trigger: {0}
ru: Этот матч никогда не сработает: {0}
tr: Bu eşleşme asla tetiklenmeyecek: {0}
zh_hans: 这个匹配永远不会触发： {0}
zh_hant: 這個匹配永遠不會觸發： {0}

# bot.chatLog.invalid_file
source: Path '{0}' contains invalid characters.
ru: Путь '{0}' содержит недопустимые символы.
tr: '{0}' yolu geçersiz karakterler içeriyor.
zh_hans: 路径'{0}'包含无效字符。
zh_hant: 路徑'{0}'包含無效字元。

# bot.DiscordBridge.canceled_sending
source: Sending message to Discord was canceled due an error occuring. For more info enable Debug.
ru: Отправка сообщения в Discord была отменена из-за ошибки. Для получения дополнительной информации включите Отладку.
tr: Oluşan bir hata nedeniyle Discorda mesaj gönderme iptal edildi. Daha fazla bilgi için Hata Ayıklamayı etkinleştirin.
zh_hans: 发生错误，已取消发送信息至Discord。打开调试日志以获得更多信息。

# bot.DiscordBridge.channel_not_found
source: The provided channel with an id '{0}' has not been found!
ru: Канал с айди '{0}' не найден!
tr: '{0}' kimliğine sahip sağlanan kanal bulunamadı!
zh_hans: 找不到ID为 '{0}' 的频道！

# bot.DiscordBridge.command_executed
source: The command was executed with the result
ru: Команда выполнена с результатом
tr: Komut sonuçla yürütüldü
zh_hans: 指令已执行，结果为

# bot.DiscordBridge.connected
source: Succesfully connected with MCC!
ru: Успешно подключено к MCC!
tr: MCC ile başarıyla bağlandı!
zh_hans: 成功与 MCC 连接！

# bot.DiscordBridge.desc
source: This command allows you to specify in the which direction the messages will be relayed via the Discord Bridge chat bot.
ru: Эта команда позволяет указать в каком направлении сообщения будут передаваться через бот дискорд бота.
tr: Bu komut, mesajların Discord Bridge sohbet botu aracılığıyla hangi yöne iletileceğini belirlemenizi sağlar.
zh_hans: 这个指令允许你指定哪一个方向的信息会被Discord Bridge转发。
