Repository: MCCTeam/Minecraft-Console-Client
Catalog: MinecraftClient/Resources/Translations/Translations.*.resx
Languages: ru, tr, zh_hans, zh_hant

# cmd.follow.note
source: NOTE: The bot is quite slow, you need to walk slowly and at a close distance for it to be able to keep up, kinda like when you make animals follow you by holding food in your hand. This is a limitation due to a pathfinding algorithm, we are working to get a better one.
ru: ПРИМЕЧАНИЕ: Бот довольно медленно, вам нужно двигаться медленно и на близком расстоянии, чтобы он мог идти дальше, добро пожаловать как когда вы заводите животных следуйте за вами, держав пищу в руке. Это ограничение из-за алгоритма поиска путей, мы работаем над получением лучшего.
tr: NOT: Bot oldukça yavaş, ayak uydurabilmesi için yavaş ve yakın bir mesafede yürümeniz gerekiyor, tıpkı elinizde yiyecek tutarak hayvanların sizi takip etmesini sağlamanız gibi. Bu bir yol bulma algoritması nedeniyle bir sınırlamadır, daha iyisini elde etmek için çalışıyoruz.
zh_hans: 注意：此机器人的速度很慢，你需要慢慢地走，而且要保持很近的距离，这样它才能跟上，有点像拿着食物让动物跟着你。这是由于寻路算法的限制，我们正在努力改进它。
zh_hant: 注意：此機器人的速度很慢，你需要慢慢地走，而且要保持很近的距離，這樣它才能跟上，有點像拿著食物讓動物跟著你。這是由於尋路演算法的限制，我們正在努力改進它。

# cmd.follow.pausing
source: Pausing!
ru: Пауза!
tr: Duraklatma!
zh_hans: 已暂停！
zh_hant: 已暫停！

# cmd.follow.player_came_to_the_range
source: The player {0} came back to the range!
ru: Игрок {0} вернулся в зону!
tr: {0} oyuncusu menzile geri döndü!
zh_hans: 玩家 {0} 回到了可寻路范围之内！
zh_hant: 玩家 {0} 回到了可尋路範圍之內！

# cmd.follow.player_left
source: The player {0} left the server!
ru: Игрок {0} покинул сервер!
tr: {0} oyuncusu sunucudan ayrıldı!
zh_hans: 玩家 {0} 离开了服务器！
zh_hant: 玩家 {0} 離開了伺服器！

# cmd.follow.player_left_the_range
source: The player {0} has left the range!
ru: Игрок {0} покинул радиус!
tr: {0} oyuncusu menzili terk etti!
zh_hans: 玩家 {0} 离开了可寻路范围！
zh_hant: 玩家 {0} 離開了可尋路範圍！

# cmd.follow.resuming
source: Resuming to follow!
ru: Возобновление приследования!
tr: Takip etmeye devam ediyoruz!
zh_hans: 继续跟随！
zh_hant: 繼續跟隨！

# cmd.follow.started
source: Started following {0}!
ru: Начал приследование {0}!
tr: {0}i takip etmeye başladı!
zh_hans: 开始跟随 {0}！
zh_hant: 開始跟隨 {0}！

# cmd.follow.stopping
source: Stopped following!
ru: Преследование остановлено!
tr: Takip etmeyi bıraktım!
zh_hans: 已停止！
zh_hant: 已停止！

# cmd.follow.switched
source: Switched to following {0}!
ru: Переключено на {0}!
tr: Değiştirildi {0}e geçildi!
zh_hans: 切换为跟随 {0}！
zh_hant: 切換為跟隨 {0}！

# cmd.follow.unsafe_enabled
source: Enabled us-safe walking (NOTE: The bot might die or get hurt!)
ru: Включена "Безопасная прогулка" (ПРИМЕЧАНИЕ: бот может погибнуть или навредить себе!)
tr: Güvensiz yürümeyi etkinleştirdi (NOT: Bot ölebilir veya yaralanabilir!)
zh_hans: 启用了允许途径不安全位置（注意：机器人可能会受伤或死亡！）
zh_hant: 啟用了允許途徑不安全位置（注意：機器人可能會受傷或死亡！）

# cmd.follow.usage
source: follow <player name|stop> [-f] (Use -f to enable un-safe walking)
ru: следуйте за <player name|stop> [-f] (Используйте -f для включения небезопасной ходьбы)
tr: follow <player name|stop> [-f] (Güvenli olmayan yürümeyi etkinleştirmek için -f kullanın)
zh_hans: follow <player name|stop> [-f] (使用 -f 允许机器人途径不安全的地方)
zh_hant: follow <player name|stop> [-f] (使用 -f 允許機器人途徑不安全的地方)

# cmd.health.desc
source: Display Health and Food saturation.
ru: Показать здоровье и насыщенность пищей.
tr: Can, doygunluk ve seviyeyi görüntüleyin.
zh_hans: 显示生命值和饱食度。
zh_hant: 顯示生命值和飽食度。

# cmd.health.response
source: Health: {0}, Saturation: {1}, Level: {2}, TotalExperience: {3}
ru: Здоровье: {0}, Насыщение: {1}, Уровень: {2}, Общий опыт: {3}
tr: Can: {0}, Doygunluk: {1}, seviye: {2}, Toplam Exp: {3}
zh_hans: 生命值：{0}，饱食度：{1}，等级：{2}，总经验值：{3}
zh_hant: 生命值：{0}，飽食度：{1}，等級：{2}，總經驗值：{3}

# cmd.inventory.clicking
source: {0} clicking slot {1} in window #{2}
ru: {0} щелчок по слоту {1} в окне #{2}
tr: {0} #{2} penceresindeki {1} slota tıklanıyor
zh_hans: {0}键点击容器#{2}中的栏位{1}
zh_hant: {0}鍵點選容器#{2}中的欄位{1}

# cmd.inventory.close
source: Closing Inventoy #{0}
ru: Закрытие инвентаря #{0}
tr: Kapanan Envanter #{0}
zh_hans: 关闭容器 #{0}
zh_hant: 關閉容器 #{0}

# cmd.inventory.close_fail
source: Failed to close Inventory #{0}
ru: Не удалось закрыть опись #{0}
tr: Envanter #{0} kapatılamadı
zh_hans: 关闭容器失败 #{0}
zh_hant: 關閉容器失敗 #{0}

# cmd.inventory.container_not_found
source: Cannot find container, please retry with explicit ID
ru: Невозможно найти контейнер, пожалуйста, повторите попытку с явным ID
tr: Slot bulunamıyor, lütfen açık bir şekilde yeniden deneyin
zh_hans: 找不到容器，请使用显式ID重试
zh_hant: 找不到容器，請使用顯式ID重試

# cmd.inventory.creative_delete
source: Requested to clear slot #{0}
ru: Запрошено очистить слот #{0}
tr: #{0} slotun temizlenmesi istendi
zh_hans: 请求清除栏位 #{0}
zh_hant: 請求清除欄位 #{0}

# cmd.inventory.creative_done
source: Requested {0} x{1} in slot #{2}
ru: Запрошено {0} x{1} в слоте #{2}
tr: {2} numaralı slotda {0} x{1} istendi
zh_hans: 向容器#{2}请求{0} x{1}
zh_hant: 向容器#{2}請求{0} x{1}

# cmd.inventory.creative_fail
source: Failed to request Creative action
ru: Не удалось запросить действие Creative
tr: Creative işlemi başarısız oldu
zh_hans: 请求创造模式操作失败
zh_hant: 請求創造模式操作失敗

# cmd.inventory.damage
source: Damage
ru: Ущерб
tr: Hasar
zh_hans: 耐久损耗
zh_hant: 耐久損耗

# cmd.inventory.desc
source: Inventory command
ru: Команда инвентаря
tr: Envanter komutu
zh_hans: 容器相关命令
zh_hant: 容器相關命令

# cmd.inventory.drop
source: Dropped 1 item from slot #{0}
ru: Сбросил 1 предмет из слота #{0}
tr: #{0} slotundan 1 öğe atıldı
zh_hans: 从栏位#{0}中丢弃了1个物品
zh_hant: 從欄位#{0}中丟棄了1個物品

# cmd.inventory.drop_stack
source: Dropped whole item stack from slot #{0}
ru: Выбросил всю стопку предметов из слота #{0}
tr: #{0} slotundan tüm öğeler atıldı
zh_hans: 从栏位#{0}中丢弃了所有堆叠的物品
zh_hant: 從欄位#{0}中丟棄了所有堆疊的物品

# cmd.inventory.found_items
source: Found items
ru: Найденные предметы
tr: Bulunan öğeler
zh_hans: 找到物品
zh_hant: 找到物品

# cmd.inventory.help.available
source: Available actions
ru: Доступные действия
tr: Kullanılabilir eylemler
zh_hans: 可用操作
zh_hant: 可用操作

# cmd.inventory.help.basic
source: Basic usage
ru: Основное использование
tr: Temel kullanım
zh_hans: 基本用法
zh_hant: 基本用法

# cmd.inventory.help.click
source: Click on an item.
ru: Нажать на элемент.
tr: Bir öğeye tıklayın.
zh_hans: 单击物品。
zh_hant: 單擊物品。

# cmd.inventory.help.close
source: Close an opened container.
ru: Закрыть открытый контейнер.
tr: Açılmış bir envanteri kapatın.
zh_hans: 关闭打开的容器。
zh_hant: 關閉開啟的容器。

# cmd.inventory.help.creativedelete
source: Clear slot in creative mode.
ru: Очистить слот в творческом режиме.
tr: Yaratıcı modda slotu temizleyin.
zh_hans: 在创造性模式中清除栏位。
zh_hant: 在創造性模式中清除欄位。

# cmd.inventory.help.creativegive
source: Give item in creative mode.
ru: Выдать предмет в творческом режиме.
tr: Öğeyi yaratıcı moddan verin.
zh_hans: 在创造模式中给予物品。
zh_hant: 在創造模式中給予物品。

# cmd.inventory.help.drop
source: Drop an item from inventory.
ru: Убрать предмет из инвентаря.
tr: Envanterden bir öğe bırakın.
zh_hans: 从容器中丢弃物品。
zh_hant: 從容器中丟棄物品。

# cmd.inventory.help.help
source: {0} Use '/inventory help <action>' for action help. 'player' and 'container' can be simplified to 'p' and 'c'. Note that parameters in '[]' are optional.
ru: {0} Используйте '/inventory help <action>' для получения справки о действиях. 'player' и 'container' могут быть упрощены до 'p' и 'c'. Note that parameters in '[]' are optional.
tr: {0} Kullanım yardımı için '/inventory help <action>' kullanın. 'player' ve 'container', 'p' ve 'c' olarak basitleştirilebilir. '[]' içindeki parametrelerin isteğe bağlı olduğunu unutmayın.
zh_hans: {0} 使用 '/inventory help <action>' 获取帮助。 'player' 和 'container' 可以简化为 'p' 和 'c'。 请注意，'[]' 中的参数是可选的。
zh_hant: {0} 使用 '/inventory help <action>' 獲取幫助。 'player' 和 'container' 可以簡化為 'p' 和 'c'。 請注意，'[]' 中的引數是可選的。

# cmd.inventory.help.inventories
source: List avaliable inventories
ru: Список доступных инвентарей
tr: Kullanılabilir envanterleri listele
zh_hans: 列出所有可用的窗口。
zh_hant: 列出所有可用的視窗。

# cmd.inventory.help.list
source: List your inventory.
ru: Список инвентаря.
tr: Envanterinizi listeleyin.
zh_hans: 列出所有容器。
zh_hant: 列出所有容器。

# cmd.inventory.help.search
source: Search for an item in avaliable Inventories
tr: Mevcut envanterlerden bir öğe arayın
zh_hans: 在打开的所有窗口中搜索物品。
zh_hant: 在開啟的所有視窗中搜索物品。

# cmd.inventory.help.shiftclick
source: Shift click an item.
tr: Shift ile bir öğeyi tıklayın.
zh_hans: 按住Shift键点击一个物品。
zh_hant: 按住Shift鍵點選一個物品。

# cmd.inventory.help.unknown
source: Unknown action.
ru: Неизвестное действие.
tr: Bilinmeyen eylem.
zh_hans: 未知操作。
zh_hant: 未知操作。

# cmd.inventory.help.usage
source: Usage
ru: Применение
tr: Kullanım
zh_hans: 用法
zh_hant: 用法

# cmd.inventory.hotbar
source: Your selected hotbar is {0}
ru: Выбранная вами горячая панель - {0}
tr: Seçtiğiniz hotbar: {0}
zh_hans: 您选择的快捷栏是{0}
zh_hant: 您選擇的快捷欄是{0}

# cmd.inventory.inventories
source: Inventories
ru: Инвентарь
tr: Envanterler
zh_hans: 容器
zh_hant: 容器

# cmd.inventory.inventories_available
source: Available Inventories
tr: Mevcut Envanterler
zh_hans: 可用容器
zh_hant: 可用容器

# cmd.inventory.inventory
source: Inventory
ru: Инвентарь
tr: Envanter
zh_hans: 容器
zh_hant: 容器

# cmd.inventory.left
source: Left
ru: Левый
tr: Sol
zh_hans: 左
zh_hant: 左

# cmd.inventory.middle
source: Middle
ru: Середина
tr: Orta
zh_hans: 中间
zh_hant: 中間

# cmd.inventory.need_creative
source: You must be in Creative gamemode
ru: Вы должны быть в творческом режиме игры
tr: Yaratıcı oyun modunda olmalısınız
zh_hans: 你必须在创造模式
zh_hant: 你必須在創造模式

# cmd.inventory.no_found_items
source: Could not find the specified item in any of avaliable Inventories!
tr: Belirtilen öğe mevcut Envanterlerin hiçbirinde bulunamadı!
zh_hans: 在任何窗口中都没有找到该物品！
zh_hant: 在任何視窗中都沒有找到該物品！

# cmd.inventory.no_item
source: No item in slot #{0}
ru: Нет предмета в слоте #{0}
tr: #{0} slotunda öğe yok
zh_hans: 栏位#{0}中没有物品
zh_hant: 欄位#{0}中沒有物品

# cmd.inventory.not_exist
source: Inventory #{0} do not exist
ru: Инвентаризация #{0} не существует
tr: Envanter #{0} mevcut değil
zh_hans: 容器#{0}不存在
zh_hant: 容器#{0}不存在

# cmd.inventory.right
source: Right
ru: Правый
tr: Sağ
zh_hans: 右
zh_hant: 右

# cmd.inventory.shiftclick
source: Shift clicking slot {0} in window #{1}
tr: #{1} penceresindeki {1} slota Shift ile tıklanıyor
zh_hans: 按住Shift键点击容器#{1}中的栏位{0}
zh_hant: 按住Shift鍵點選容器#{1}中的欄位{0}

# cmd.inventory.shiftclick_fail
source: Shift click failed, this may be because this container type is not supported
tr: Shift tıklaması başarısız oldu, bunun nedeni bu kapsayıcı türünün desteklenmemesi olabilir
zh_hans: 执行Shift点击失败，这可能是因为该容器类型目前不被支持。
zh_hant: 執行Shift點選失敗，這可能是因為該容器型別目前不被支援。

# cmd.list.desc
source: get the player list.
ru: получить список игроков.
tr: oyuncu listesini alın.
zh_hans: 获取玩家列表。
zh_hant: 獲取玩家列表。

# cmd.list.players
source: PlayerList: {0}
ru: Список игроков: {0}
tr: Oyuncu listesi: {0}
zh_hans: 玩家列表：{0}
zh_hant: 玩家列表：{0}

# cmd.log.desc
source: log some text to the console.
ru: записать текст в консоль.
tr: konsola bazı metinler kaydedin.
zh_hans: 将文本记录到控制台。
zh_hant: 將文字記錄到控制檯。

# cmd.look.at
source: Looking at yaw: {0} pitch: {1}
ru: Посмотреть на YAW: {0} PITCH: {1}
tr: Bakılan yön yaw: {0} pitch: {1}
zh_hans: 当前视角 偏航角：{0} 俯仰角：{1}。
zh_hant: 當前視角 偏航角：{0} 俯仰角：{1}。

# cmd.look.block
source: Looking at {0}
ru: Посмотреть на {0}
tr: {0}e bakmak
zh_hans: 正看向位于 {0} 的方块。
zh_hant: 正看向位於 {0} 的方塊。

# cmd.look.desc
source: look at direction or coordinates.
ru: смотреть направление или координаты.
tr: yön veya koordinatlara bakın.
zh_hans: 查看方向或坐标。
zh_hant: 檢視方向或座標。

# cmd.look.inspection
source: The block currently intersecting the line of sight is {0} ({1:0}, {2:0}, {3:0}), distance is {4:0.0}({5:0.0}).
tr: Şu anda görüş hattını kesen blok {0} ({1:0}, {2:0}, {3:0}), mesafe {4:0.0}({5:0.0}).
zh_hans: 与视线相交的第一个方块是 {0} ({1:0}, {2:0}, {3:0})，距离玩家 {4:0.0}({5:0.0})。
zh_hant: 與視線相交的第一個方塊是 {0} ({1:0}, {2:0}, {3:0})，距離玩家 {4:0.0}({5:0.0})。

# cmd.look.noinspection
source: There is no block within {0} meters that intersects with the line of sight.
tr: {0} metre içinde görüş hattıyla kesişen herhangi bir blok yok.
zh_hans: 在 {0} 米内没有任何方块与视线相交。
zh_hant: 在 {0} 米內沒有任何方塊與視線相交。

# cmd.look.unknown
source: Unknown direction '{0}'
ru: Неизвестное направление '{0}'
tr: Bilinmeyen yön '{0}'
zh_hans: 未知方向 '{0}'。
zh_hant: 未知方向 '{0}'。

# cmd.move.chunk_loading_status
source: Chunk loading status: {0:P} - {1} out of {2} load completed.
tr: Chunk yükleme durumu: {0:P} - {2} yükten {1} tanesi tamamlandı.
zh_hans: 区块加载进度：{0:P} - 共{2}个，加载完成了{1}个。
zh_hant: 區塊載入進度：{0:P} - 共{2}個，載入完成了{1}個。

# cmd.move.chunk_not_loaded
source: The chunk where the target location resides has not yet been loaded. You can use "/chunk status {0:0.0} {1:0.0} {2:0.0}" to check the chunk loading status.
tr: Hedef konumun bulunduğu chunk henüz yüklenmedi. Chunk yükleme durumunu kontrol etmek için "/chunk status {0:0.0} {1:0.0} {2:0.0}" kullanabilirsiniz.
zh_hans: 目标位置所在的区块还没有被加载。你可以使用"/chunk status {0:0.0} {1:0.0} {2:0.0}"来查看区块的加载状态。
zh_hant: 目標位置所在的區塊還沒有被載入。你可以使用"/chunk status {0:0.0} {1:0.0} {2:0.0}"來檢視區塊的載入狀態。

# cmd.move.desc
source: walk or start walking.
ru: идти или начать идти.
tr: yürüyün veya yürümeye başlayın.
zh_hans: 移动或开始移动。
zh_hant: 移動或開始移動。

# cmd.move.dir_fail
source: Cannot move in that direction.
ru: Невозможно двигаться в этом направлении.
tr: O yönde hareket edilemiyor.
zh_hans: 不能朝此方向移动。
zh_hant: 不能朝此方向移動。

# cmd.move.disable
source: Disabling Terrain and Movements.
ru: Отключить местность и перемещения.
tr: Terrain and Movements özelliği artık devre dışı.
zh_hans: 禁用地形和移动。
zh_hant: 禁用地形和移動。

# cmd.move.enable
source: Enabling Terrain and Movements on next server login, respawn or world change.
ru: Включение рельефа и движений при следующем входе на сервер, перерождении или изменении мира.
tr: Bir sonraki sunucu oturumunda, yeniden doğmada veya dünya değişiminde Terrain and Movements etkinleştirin.
zh_hans: 在下次服务器登录、重生或更换世界时启用地形和移动。
zh_hant: 在下次伺服器登入、重生或更換世界時啟用地形和移動。

# cmd.move.fail
source: Failed to compute path to {0}
ru: Не удалось вычислить путь к {0}
tr: {0} yolunu hesaplayamadı
zh_hans: 无法计算到达{0}的路径。
zh_hant: 無法計算到達{0}的路徑。

# cmd.move.gravity.disabled
source: Gravity is disabled.
tr: Gravity devre dışı.
zh_hans: 重力已关闭。
zh_hant: 重力已關閉。

# cmd.move.gravity.enabled
source: Gravity is enabled.
tr: Gravity etkinleştirildi.
zh_hans: 重力已开启。
zh_hant: 重力已開啟。

# cmd.move.moving
source: Moving {0}
ru: Перемещение {0}
tr: {0} yürünüyor
zh_hans: 移动{0}
zh_hant: 移動{0}

# cmd.move.suggestforce
source: Failed to compute a safe path to {0}. Try -f parameter to allow unsafe movements.
tr: {0} için güvenli bir yol hesaplanamadı. Güvenli olmayan hareketlere izin vermek için -f parametresini deneyin.
zh_hans: 无法计算安全到达{0}的路径. 请使用 -f 参数允许不安全移动。
zh_hant: 無法計算安全到達{0}的路徑. 請使用 -f 引數允許不安全移動。

# cmd.move.walk
source: Walking from {1} to {0}
ru: Путь к {0}
tr: {1} ile {0} arasında yürüyüş
zh_hans: 移动到{0}
zh_hant: 移動到{0}

# cmd.reco.desc
source: restart and reconnect to the server.
ru: перезапустить и заново подключиться к серверу.
tr: yeniden başlatın ve sunucuya yeniden bağlanın.
zh_hans: 重新启动并重新连接到服务器。
zh_hant: 重新啟動並重新連線到伺服器。

# cmd.reload.desc
source: Reloads MCC settings.
tr: MCC ayarlarını yeniden yükler.
zh_hans: 重新加载MCC的设置。
zh_hant: 重新載入MCC的設定。

# cmd.reload.finished
source: Reloaded Settings!
tr: Ayarlar Yeniden Yüklendi!
zh_hans: 重新加载设置完成！
zh_hant: 重新載入設定完成！

# cmd.reload.started
source: Reloading settings...
tr: Ayarlar yeniden yükleniyor...
zh_hans: 重新加载设置中...
zh_hant: 重新載入設定中...

# cmd.reload.warning1
source: This command will NOT affect certain settings which are used before connecting to a server!
tr: Bu komut, bir sunucuya bağlanmadan önce kullanılan belirli ayarları ETKİLEMEZ!
zh_hans: 这条命令不会影响在连接到服务器之前的某些设置。
zh_hant: 這條命令不會影響在連線到伺服器之前的某些設定。

# cmd.reload.warning2
source: Some settings passed through the command line parameters might get overriden!
tr: Komut satırı parametrelerinden geçirilen bazı ayarlar geçersiz kılınabilir!
zh_hans: 一些通过命令行参数传递的设置可能会被覆盖！
zh_hant: 一些通過命令列引數傳遞的設定可能會被覆蓋！

# cmd.reload.warning3
source: You also might need to reconnect for some settings to take effect.
tr: Ayrıca bazı ayarların etkili olması için yeniden bağlanmanız gerekebilir.
zh_hans: 你有可能需要重新连接(/reco)才能使某些设置生效。
zh_hant: 你有可能需要重新連線(/reco)才能使某些設定生效。

# cmd.reload.warning4
source: Replay Chat Bot will not be hard reloaded due to technical limitations!
tr: Replay Chat Botu, teknik sınırlamalar nedeniyle yeniden yüklenmeyecek!
zh_hans: 由于技术限制，ReplayCapturer 将不会被强制重载!
zh_hant: 由於技術限制，ReplayCapturer 將不會被強制過載!

# cmd.respawn.desc
source: Use this to respawn if you are dead.
ru: Используйте это, чтобы возродиться, если вы мертвы.
tr: Öldüyseniz yeniden doğmak için bunu kullanın.
zh_hans: 如果你死亡了，请用这个来重生。
zh_hant: 如果你死亡了，請用這個來重生。

# cmd.respawn.done
source: You have respawned.
ru: Вы переродились.
tr: Yeniden doğdun.
zh_hans: 你重生了。
zh_hant: 你重生了。

# cmd.script.desc
source: run a script file.
ru: запустить файл скрипта.
tr: Yeniden doğdun.
zh_hans: 运行脚本文件。
zh_hant: 執行指令碼檔案。

# cmd.send.desc
source: send a chat message or command.
ru: отправить сообщение в чат или команду.
tr: bir sohbet mesajı veya komutu gönderin.
zh_hans: 发送聊天信息或命令。
zh_hant: 傳送聊天資訊或命令。

# cmd.set.desc
source: set a custom %variable%.
ru: установить пользовательскую %переменную%.
tr: özel bir %variable% ayarlayın.
zh_hans: 设置自定义 %variable%。
zh_hant: 設定自定義 %variable%。

# cmd.set.format
source: variable name must be A-Za-z0-9.
ru: имя переменной должно быть A-Za-z0-9.
tr: değişken adı A-Za-z0-9 olmalıdır.
zh_hans: 变量名范围必须为 A-Za-z0-9。
zh_hant: 變數名範圍必須為 A-Za-z0-9。

# cmd.setrnd.desc
source: set a custom %variable% randomly to a given value.
tr: belirli bir değere rastgele özel bir %variable% ayarlayın.
zh_hans: 随机为自定义 %变量名% 赋值。
zh_hant: 隨機為自定義 %變數名% 賦值。

# cmd.setrndnum.format
source: setrnd variable -7 to 17
tr: setrnd değişkeni -7to17
zh_hans: setrnd 变量名 -7to17
zh_hant: setrnd 變數名 -7to17

# cmd.setrndstr.format
source: setrnd variable string1 "\"string2\" string3"
tr: setrnd değişkeni string1 "\"string2\" string3"
zh_hans: setrnd 变量名 字符串1 "\"字符串2\" 字符串3"
zh_hant: setrnd 變數名 字串1 "\"字串2\" 字串3"

# cmd.sneak.desc
source: Toggles sneaking
ru: Выключает подкрадывание
tr: Eğilme/Kalkma
zh_hans: 切换到潜行
zh_hant: 切換到潛行

# cmd.sneak.off
source: You are not sneaking anymore
ru: Вы больше не крадетесь
tr: Eğilemyi bıraktın.
zh_hans: 你不在潜行状态了。
zh_hant: 你不在潛行狀態了。

# cmd.sneak.on
source: You are sneaking now
ru: Вы сейчас крадетесь
tr: Şu an eğiliyorsun.
zh_hans: 现在你在潜行状态。
zh_hant: 現在你在潛行狀態。

# cmd.tps.current
source: Current tps
ru: Текущий tps
tr: Mevcut tps
zh_hans: 当前TPS
zh_hant: 當前TPS

# cmd.tps.desc
source: Display server current tps (tick per second). May not be accurate
ru: Отображает текущий показатель tps (тик в секунду) сервера. Может быть неточным
tr: Sunucu geçerli tps sini görüntüleyin (saniye başına onay). doğru olmayabilir
zh_hans: 显示服务器当前tps (tick per second)。（可能不精确）
zh_hant: 顯示伺服器當前tps (tick per second)。（可能不精確）

# cmd.useblock.desc
source: Place a block or open chest
ru: Поставить блок или открыть сундук
tr: Bir blok yerleştin veya sandık açın
zh_hans: 放置一个方块或打开箱子
zh_hant: 放置一個方塊或開啟箱子

# cmd.useblock.use
source: Useblock at ({0:0.0}, {1:0.0}, {2:0.0}) {3}.
tr: Kullanılan blok ({0:0.0}, {1:0.0}, {2:0.0}) {3}
zh_hans: 使用位于 ({0:0.0}, {1:0.0}, {2:0.0}) 的 {3}。
zh_hant: 使用位於 ({0:0.0}, {1:0.0}, {2:0.0}) 的 {3}。

# cmd.useitem.desc
source: Use (left click) an item on the hand
ru: Использовать (левый клик) предмет на руке
tr: Eldeki bir öğeyi kullanın (sol tıklama)
zh_hans: 使用（左键单击）手上的物品
zh_hant: 使用（左鍵單擊）手上的物品

# cmd.useitem.use
source: Used an item
ru: Использовать предмет
tr: Bir öğe kullandı
zh_hans: 使用了一个物品。
zh_hant: 使用了一個物品。

# config.backup.fail
source: Failed to write to backup file {0}
ru: §cFailed to write to backup file {0}§r
tr: §c{0} ayar uzantısına yazılamadı§r
zh_hans: §c写入设置文件（{0}）时出错：§r
zh_hant: §c寫入設定檔案（{0}）時出錯：§r

# config.load
source: Settings have been loaded from {0}
tr: Ayarlar {0} adresinden yüklendi
zh_hans: 已从 {0} 加载设置。
zh_hant: 已從 {0} 載入設定。

# config.load.fail
source: Failed to load settings:
ru: §cFailed to load settings:§r
tr: §cAyarlar yüklenemedi:§r
zh_hans: §c加载设置时出错：§r
zh_hant: §c載入設定時出錯：§r

# config.Main.Advanced.language.invaild
source: The language code is invalid!
tr: Dil kodu geçersiz!
zh_hans: 无效的语言代码！
zh_hant: 無效的語言程式碼！

# config.saving
source: The current setting is saved as {0}
ru: §aThe current setting is saved as {0}
tr: §aGeçerli ayarlar {0} dosyasına kaydediliyor
zh_hans: §a当前设置已保存至 {0}
zh_hant: §a當前設定已儲存至 {0}

# config.write.fail
source: Failed to write to settings file {0}
ru: §cFailed to write to settings file {0}§r
tr: §c{0} ayar dosyasına yazılamadı§r
zh_hans: §保存备份文件（{0}）时出错：§r
zh_hant: §儲存備份檔案（{0}）時出錯：§r

# debug.color_test
source: Color test: Your terminal should display {0}
ru: Цветовой тест: В вашем терминале должно отображаться {0}
tr: Renk testi: Terminaliniz {0} görüntülemelidir
zh_hans: 颜色测试：终端应该显示：{0}
zh_hant: 顏色測試：終端應該顯示：{0}

# debug.crypto
source: Crypto keys & hash generated.
ru: §8Сгенерированы криптографические ключи и хэш.
tr: §8Kripto anahtarları ve hash oluşturuldu.
zh_hans: §8密钥和哈希值已生成：
zh_hant: §8金鑰和雜湊值已生成：

# debug.keys_cache_fail
source: No profile keys could be loaded from disk
ru: §8No profile keys could be loaded from disk
tr: §8Diskten profil anahtarı yüklenemedi
zh_hans: §8无法从磁盘中加载聊天签名密钥。
zh_hant: §8無法從磁碟中載入聊天簽名金鑰。

# debug.keys_cache_ok
source: Profile keys has been successfully loaded from disk.
ru: §8Profile keys has been successfully loaded from disk.
tr: §8Profil anahtarları diskten başarıyla yüklendi.
zh_hans: §8已成功从磁盘中加载聊天签名密钥。
zh_hant: §8已成功從磁碟中載入聊天簽名金鑰。

# debug.request
source: Performing request to {0}
ru: §8Выполняем запрос к {0}
tr: §8{0} için istek gerçekleştiriliyor
zh_hans: §8正在请求{0}...
zh_hant: §8正在請求{0}

# debug.session_cache_fail
source: No sessions could be loaded from disk
ru: §8Ни одна сессия не могла быть загружена с диска
tr: §8Diskten hiçbir oturum yüklenemedi
zh_hans: §8无法从磁盘加载缓存的会话数据。
zh_hant: §8無法從磁碟載入快取的會話資料。

# debug.session_cache_ok
source: Session data has been successfully loaded from disk.
ru: §8Данные сессии успешно загружены с диска.
tr: §8Oturum verileri diskten başarıyla yüklendi.
zh_hans: §8已成功从磁盘中加载会话数据。
zh_hant: §8已成功從磁碟中載入會話資料。

# debug.session_id
source: Success. (session ID: {0})
ru: Успех. (ID сессии: {0})
tr: Başarılı. (Oturum ID: {0})
zh_hans: 成功！(会话ID：{0})
zh_hant: 成功！(會話ID：{0})

# Enchantment.bottom_slot
source: Bottom slot
tr: Alt slot
zh_hans: 底部槽位

# Enchantment.enchantments_available
source: Enchantments available
tr: Büyüler mevcut
zh_hans: 可选的附魔

# Enchantment.levels
source: Levels
tr: Seviyeler
zh_hans: 等级

# Enchantment.middle_slot
source: Middle slot
tr: Orta slot
zh_hans: 中间槽位

# Enchantment.tops_slot
source: Top slot
tr: Üst slot
zh_hans: 顶部槽位

# error.auth
source: Got error code from server while refreshing authentication: {0}
ru: §8Получили код ошибки от сервера при обновлении аутентификации: {0}
tr: §8Kimlik doğrulama yenilenirken sunucudan hata kodu alındı: {0}
zh_hans: §8在刷新身份验证时接收到服务器错误：{0}
zh_hant: §8在重新整理身份驗證時接收到伺服器錯誤：{0}

# error.connect
source: Failed to connect to this IP.
ru: Не удалось подключиться к этому IP.
tr: Bu IPye bağlanılamadı.
zh_hans: 无法连接到此IP。
zh_hant: 無法連線到此IP。

# error.connection_timeout
source: A timeout occured while attempting to connect to this IP.
ru: §8При попытке подключения к этому IP произошел тайм-аут.
tr: §8Bu IPye bağlanmaya çalışılırken bir zaman aşımı oluştu.
zh_hans: §8尝试连接到此IP时超时。
zh_hant: §8嘗試連線到此IP時超時。

# error.determine
source: Failed to determine server version.
ru: Не удалось определить версию сервера.
tr: Sunucu sürümü belirlenemedi.
zh_hans: 无法确定服务器版本。
zh_hant: 無法確定伺服器版本。

# error.forge
source: Forge Login Handshake did not complete successfully
ru: §8Forge Login Handshake не завершилось успешно
tr: §8Forge Giriş El Sıkışma başarıyla tamamlanmadı
zh_hans: §8Forge登录握手未成功完成
zh_hant: §8Forge登入握手未成功完成
